Repository: GNOME/genius
Catalog: po/*.po
Languages: fr

source: Integration of f by Composite Simpson's Rule on the interval [a,b] with the number of steps calculated by the fourth derivative bound and the desired tolerance
fr: Intégration de f par la méthode de Simpson composée sur l'intervalle [a,b] avec un nombre d'étapes calculé à l'aide de la borne de la dérivée quatrième et la tolérance souhaitée

source: Attempt to calculate derivative by trying first symbolically and then numerically
fr: Tente de calculer la dérivée en essayant d'abord une approche symbolique puis numérique

source: Return a function which is the even periodic extension of f defined on the interval [0,L]
fr: Renvoie une fonction qui est l'extension périodique paire de f définie sur l'intervalle [0,L]

source: Return a function which is a Fourier series with the coefficients given by the vectors a (sines) and b (cosines). Note that a@(1) is the constant coefficient!
fr: Renvoie une fonction qui est la série de Fourier de coefficients donnés par les vecteurs a (cosinus) et b (sinus). Notez que a@(1) est le coefficient constant.

source: Try to calculate an infinite product for a single parameter function
fr: Essaie de calculer un produit infini pour une fonction à un seul paramètre

source: Try to calculate an infinite product for a double parameter function with func(arg,n)
fr: Essaie de calculer un produit infini pour une fonction à deux paramètres avec func(arg,n)

source: Try to calculate an infinite sum for a single parameter function
fr: Essaie de calculer une somme infinie pour une fonction à un seul paramètre

source: Try to calculate an infinite sum for a double parameter function with func(arg,n)
fr: Essaie de calculer une somme infinie pour une fonction à deux paramètres avec func(arg,n)

source: Try and see if a real-valued function is continuous at x0 by calculating the limit there
fr: Essaie de voir si une fonction à valeur réelle est continue en x0 en calculant la limite en ce point

source: Test for differentiability by approximating the left and right limits and comparing
fr: Teste de différentiabilité en approchant les limites gauche et droite et en les comparant

source: Calculate the left limit of a real-valued function at x0
fr: Calcule la limite gauche d'une fonction à valeurs réelles en x0

source: Calculate the limit of a real-valued function at x0. Tries to calculate both left and right limits.
fr: Calcule la limite d'une fonction à valeur réelle en x0. Essaie de calculer les deux limites gauche et droite.

source: Integration by midpoint rule
fr: Intégration par la méthode des rectangles

source: Attempt to calculate numerical derivative
fr: Essaie de calculer la dérivée par méthode numérique

source: Numerically compute the coefficients for a cosine Fourier series for a function on [0,L] up to the Nth coefficient.
fr: Calcule numériquement les coefficients de la série de Fourier en cosinus pour une fonction définie sur [0,L] jusqu'au N-ième coefficient.

source: Return a function which is the Fourier cosine series of f on [0,L] with coefficients up to N computed numerically
fr: Renvoie une fonction qui est la série de Fourier en cosinus de f sur [0,L] avec N coefficients calculés numériquement

source: Numerically compute the coefficients for a Fourier series with half-period L up to the Nth coefficient.
fr: Calcule numériquement les coefficients de la série de Fourier de demi-période L jusqu'au N-ième coefficient.

source: Return a function which is the Fourier series of f with half-period L with coefficients up to N computed numerically
fr: Renvoie une fonction qui est la série de Fourier de f de demi-période L avec N coefficients calculés numériquement

source: Numerically compute the coefficients for a sine Fourier series for a function on [0,L] up to the Nth coefficient.
fr: Calcule numériquement les coefficients de la série de Fourier en sinus pour une fonction définie sur [0,L] jusqu'au N-ième coefficient.

source: Return a function which is the Fourier sine series of f on [0,L] with coefficients up to N computed numerically
fr: Renvoie une fonction qui est la série de Fourier en sinus de f sur [0,L] avec N coefficients calculés numériquement

source: Integration by rule set in NumericalIntegralFunction of f from a to b using NumericalIntegralSteps steps
fr: Intégration de f de a à b, en suivant la règle définie par NumericalIntegralFunction et en utilisant les NumericalIntegralSteps pas.

source: Attempt to calculate numerical left derivative
fr: Essaie de calculer la dérivée à gauche numériquement

source: Attempt to calculate the limit of f(step_fun(i)) as i goes from 1 to N
fr: Essaie de calculer la limite de f (step_fun(i)) pour i allant de 1 à N

source: Attempt to calculate numerical right derivative
fr: Essaie de calculer la dérivée à droite numériquement

source: Return a function which is the odd periodic extension of f defined on the interval [0,L]
fr: Renvoie une fonction qui est l'extension périodique impaire de f définie sur l'intervalle [0,L]

source: Compute one-sided derivative using five point formula
fr: Calcule la dérivée d'un côté en utilisant une formule à cinq points

source: Compute one-sided derivative using three-point formula
fr: Calcule la dérivée d'un côté en utilisant une formule à trois points

source: Return a function which is the periodic extension of f defined on the interval [a,b]
fr: Renvoie une fonction qui est l'extension périodique de f définie sur l'intervalle [a,b]

source: Calculate the right limit of a real-valued function at x0
fr: Calcule la limite à droite d'une fonction à valeurs réelles en x0

source: Compute two-sided derivative using five-point formula
fr: Calcule la dérivée des deux côtés en utilisant une formule à cinq points

source: Compute two-sided derivative using three-point formula
fr: Calcule la dérivée des deux côtés en utilisant une formule à trois points

source: argument (angle) of complex number
fr: argument (angle) d'un nombre complexe

source: Dirichlet kernel of order n
fr: Noyau de Dirichlet d'ordre n

source: Returns 1 if and only if all elements are zero
fr: Renvoie 1 ssi tous les éléments sont nuls

source: Fejer kernel of order n
fr: Noyau Fejer d'ordre n

source: Returns 1 if and only if all elements are equal
fr: Renvoie 1 ssi tous les éléments sont égaux

source: Principal branch of the Lambert W function for real values greater than or equal to -1/e
fr: Branche principale de la fonction W de Lambert pour les valeurs réelles plus grandes ou égales à -1/e

source: The minus-one branch of the Lambert W function for real values between -1/e and 0
fr: La branche moins-un de la fonction W de Lambert pour les valeurs réelles entre -1/e et 0

source: Find the first value where f(x)=0
fr: Cherche la première valeur pour laquelle f(x)=0

source: Moebius mapping of the disk to itself mapping a to 0
fr: Transformation de Möbius du disque vers lui-même en prenant a à 0

source: Moebius mapping using the cross ratio taking z2,z3,z4 to 1,0, and infinity respectively
fr: Transformation de Möbius utilisant le rapport croisé en prenant z2, z3, z4 à 1, 0 et l'infini respectivement

source: Moebius mapping using the cross ratio taking infinity to infinity and z2,z3 to 1 and 0 respectively
fr: Transformation de Möbius utilisant le rapport croisé en prenant l'infini à l'infini et z2, z3 à 1 et 0 respectivement

source: Moebius mapping using the cross ratio taking infinity to 1 and z3,z4 to 0 and infinity respectively
fr: Transformation de Möbius utilisant le rapport croisé en prenant l'infini à 1 et z3, z4 à 0 et l'infini respectivement

source: Moebius mapping using the cross ratio taking infinity to 0 and z2,z4 to 1 and infinity respectively
fr: Transformation de Möbius utilisant le rapport croisé en prenant l'infini à 0 et z2, z4 à 1 et l'infini respectivement

source: Poisson kernel on D(0,1) (not normalized to 1, that is integral of this is 2pi)
fr: Le noyau de Poisson sur D(0,1) (non normalisé à 1 donc son intégrale vaut 2 pi)

source: Poisson kernel on D(0,R) (not normalized to 1)
fr: Le noyau de Poisson sur D(0,R) (non normalisé à 1)

source: The unit step function = 0 for x<0, 1 otherwise. This is the integral of the Dirac Delta function.
fr: La fonction échelon = 0 pour x<0, 1 sinon. C'est l'intégrale de la fonction delta de Dirac.

source: The cis function, that is cos(x)+i*sin(x)
fr: Fonction cis, c'est-à-dire cos(x)+i*sin(x)

source: Convert degrees to radians
fr: Convertit les degrés en radians

source: Convert radians to degrees
fr: Convertit les radians en degrés

source: Find roots of a cubic polynomial (given as vector of coefficients)
fr: Cherche les racines d'un polynôme cubique (donné par un vecteur de coefficients)

source: Use classical Euler's method to numerically solve y'=f(x,y) for initial x0,y0 going to x1 with n increments, returns y at x1
fr: Utilise la méthode classique d'Euler pour résoudre numériquement y'=f(x,y) avec les valeurs initiales x0, y0 allant à x1 avec n incréments, renvoie y en x1

source: Use classical Euler's method to numerically solve y'=f(x,y) for initial x0,y0 going to x1 with n increments, returns an n+1 by 2 matrix of values
fr: Utilise la méthode classique d'Euler pour résoudre numériquement y'=f(x,y) avec les valeurs initiales x0, y0 allant à x1 avec n incréments, renvoie une matrice n+1 par 2 contenant les valeurs

source: Find root of a function using the bisection method to within TOL tolerance in up to N iterations. f(a) and f(b) must have opposite signs.
fr: Cherche la racine d'une fonction en utilisant la méthode de la bissection (dichotomie) dans les limites de la tolérance TOL jusqu'à N itérations. f(a) et f(b) doivent être de signes opposés.

source: Find root of a function using the method of false position to within TOL tolerance in up to N iterations. f(a) and f(b) must have opposite signs.
fr: Cherche la racine d'une fonction en utilisant la méthode de fausse position dans les limites de la tolérance TOL jusqu'à N itérations. f(a) et f(b) doivent être de signes opposés.

source: Find root of a function using the Muller's method
fr: Cherche la racine d'une fonction en utilisant la méthode de Muller

source: Find root of a function using the secant method to within TOL tolerance in up to N iterations. f(a) and f(b) must have opposite signs.
fr: Cherche la racine d'une fonction en utilisant méthode de la sécante dans les limites de la tolérance TOL jusqu'à N itérations. f(a)et f(b) doivent être de signes opposés.

source: Attempt to find a zero of a function f with derivative df and second derivative ddf using Halley's method, returning after two successive values are within epsilon or after maxn tries (then returns null)
fr: Essaie de trouver le 0 d'une fonction f avec la dérivée df et la dérivée seconde ddf en utilisant la méthode de Halley, s'arrêtant après que deux valeurs successives sont à epsilon près, ou après maxn essais (renvoie alors « null »)

source: Attempt to find a zero of a function f with derivative df using Newton's method, returning after two successive values are within epsilon or after maxn tries (then returns null)
fr: Essaie de trouver le zéro d'une fonction f avec la dérivée df en utilisant la méthode de Newton , renvoie après que deux valeurs successives sont à epsilon près, ou après maxn essais (renvoie alors « null »)

source: Find roots of a polynomial (given as vector of coefficients)
fr: Cherche les racines d'un polynôme (donné par un vecteur de coefficients)

source: Find roots of a quartic polynomial (given as vector of coefficients)
fr: Cherche les racines d'un polynôme quartique (donné par un vecteur de coefficients)

source: Use classical non-adaptive Runge-Kutta of fourth order method to numerically solve y'=f(x,y) for initial x0,y0 going to x1 with n increments, returns y at x1
fr: Utilise la méthode classique non adaptative de Runge-Kutta du quatrième ordre pour résoudre numériquement y'=f(x,y) avec les valeurs initiales x0, y0 allant à x1 avec n incréments, renvoie y en x1

source: Use classical non-adaptive Runge-Kutta of fourth order method to numerically solve y'=f(x,y) for initial x0,y0 going to x1 with n increments, returns an n+1 by 2 matrix of values
fr: Utilise la méthode classique non adaptative de Runge-Kutta du quatrième ordre pour résoudre numériquement y'=f(x,y) avec les valeurs initiales x0, y0 allant à x1 avec n incréments, renvoie une matrice n+1 par 2 contenant les valeurs

source: Calculate average of an entire matrix
fr: Calcule la moyenne de toute une matrice

source: Integral of the GaussFunction from 0 to x (area under the normal curve)
fr: Intégrale de la fonction de Gauss de 0 à x (aire sous la courbe normale)

source: The normalized Gauss distribution function (the normal curve)
fr: Fonction distribution de Gauss normalisée (courbe normale)

source: Calculate median of an entire matrix
fr: Calcule la médiane de toute une matrice

source: Calculate the population standard deviation of a whole matrix
fr: Calcule l'écart-type de la population de toute une matrice

source: Calculate average of each row in a matrix
fr: Calcule la moyenne de chaque ligne d'une matrice

source: Calculate median of each row in a matrix
fr: Calcule la médiane de chaque ligne d'une matrice

source: Calculate the population standard deviations of rows of a matrix and return a vertical vector
fr: Calcule l'écart-type de la population des lignes d'une matrice et renvoie un vecteur vertical

source: Calculate the standard deviations of rows of a matrix and return a vertical vector
fr: Calcule l'écart-type des lignes d'une matrice et renvoie un vecteur vertical

source: Calculate the standard deviation of a whole matrix
fr: Calcule l'écart-type de toute une matrice

source: Attempt to find a root of a polynomial using Newton's method, returning after two successive values are within epsilon or after maxn tries (then returns null)
fr: Essaie de trouver la racine d'un polynôme en utilisant la méthode de Newton renvoyant après que deux valeurs successives sont à epsilon près ou après maxn essais (renvoie alors « null »)

source: Returns a set where every element of X appears only once
fr: Renvoie un ensemble où chaque élément de X apparaît seulement une fois

source: Returns a set theoretic union of X and Y (X and Y are vectors pretending to be sets)
fr: Renvoie l'ensemble union théorique de X et Y (X et Y sont des vecteurs prétendus être des ensembles)

source: For a Hilbert function that is c for degree d, given the Macaulay bound for the Hilbert function of degree d+1 (The c^<d> operator from Green's proof)
fr: Pour une fonction de Hilbert qui vaut c pour le degré d, étant donné la limite de Macaulay pour la fonction de Hilbert de degré d+1 (l'opérateur c^<d> de la preuve de Green)

source: The c_<d> operator from Green's proof of Macaulay's Theorem
fr: L'opérateur c_<d> de la preuve de Green du théorème de Macaulay

source: Return the dth Macaulay representation of a positive integer c
fr: Renvoie la d-ième représentation de Macaulay d'un entier positif c

source: Attempt to symbolically differentiate a function n times
fr: Essaie de dériver n fois de manière symbolique une fonction

source: Attempt to symbolically differentiate a function n times quietly and return null on failure
fr: Essaie de dériver silencieusement n fois de manière symbolique une fonction et renvoie « null » en cas d'échec

source: Attempt to construct the Taylor approximation function around x0 to the nth degree.
fr: Essaie de construire la fonction approximation de Taylor autour de x0 au n-ième degré.

source: Uncategorized
fr: Hors catégorie

source: Trying to set an alias for an alias
fr: Essaie de définir un alias pour un alias

source: Bad identifier for function node!
fr: Mauvais identificateur de nœud de fonction.

source: Unexpected operator!
fr: Opérateur inattendu.

source: Cannot currently print polynomials of more than 3 vars
fr: Impossible d'afficher actuellement des polynômes de plus de 3 variables

source: NULL function!
fr: Fonction « NULL ».

source: Unexpected function type!
fr: Type de fonction inattendue.

source: NULL tree!
fr: Arborescence « NULL ».

source: Unexpected node!
fr: Nœud inattendu.

source: File '%s' is a wrong version of GEL
fr: Le fichier « %s » contient une mauvaise version de GEL

source: Badly formed record
fr: Enregistrement malformé

source: Record out of place
fr: Enregistrement mal placé

source: Missing value for function
fr: Valeur manquante pour la fonction

source: Extra dictionary for NULL function
fr: Dictionnaire additionnel pour la fonction « NULL »

source: Can't open file: '%s'
fr: Impossible d'ouvrir le fichier : « %s »

source: Load a file into the interpreter
fr: Charge un fichier dans l'interpréteur

source: Load a plugin
fr: Charge un greffon

source: List files in the current directory
fr: Liste les fichiers dans le répertoire courant

source: Change directory
fr: Change de répertoire

source: Print current directory
fr: Affiche le répertoire courant

source: Print help (or help on a function/command)
fr: Affiche l'aide (ou l'aide d'une fonction/commande)

source: For a manual on using Genius and the GEL language type:
fr: Pour un manuel sur l'utilisation de Genius et du langage GEL :

source: manual
fr: manuel

source: For help on a specific function type:
fr: Pour l'aide sur une fonction spécifique :

source: help FunctionName
fr: help NomDeLaFonction

source: Commands:
fr: Commandes :

source: Undocumented:
fr: Non documenté :

source: Not documented
fr: Non documenté

source: '%s' is not documented
fr: « %s » n'est pas documenté

source: '%s' is not documented. Perhaps you meant %s.
fr: « %s » n'est pas documenté. Peut-être vouliez-vous dire %s.

source: %s is an alias for %s
fr: %s est un alias pour %s

source: Parameter:
fr: Paramètre :

source: Aliases:
fr: Alias :

source: Error changing to directory '%s': %s
fr: Erreur lors du changement de répertoire « %s » : %s

source: Can't expand '%s'
fr: Impossible de développer « %s »

source: Cannot open plugin '%s'!
fr: Impossible d'ouvrir le greffon « %s ».

source: getcwd error: %s
fr: erreur de getcwd : %s

source: ERROR: 'pipe' failed: %s
fr: ERREUR : échec du « tube » (pipe) : %s

source: ERROR: 'write' possibly failed: %s
fr: ERREUR : il se peut que l'opération d'écriture n'est pas fonctionnée : %s

source: ERROR: Probably corrupt stack!
fr: ERREUR : la pile est probablement corrompue.

source: ERROR: 'local' in a wrong place, can only be first statement in a function!
fr: ERREUR : mauvais emplacement pour « local », ne peut être que le premier argument d'une fonction.

source: ERROR: Can't execute more things at once!
fr: ERREUR : impossible d'exécuter plus de choses à la fois.

source: ERROR: %s before newline
fr: ERREUR : %s avant le retour à la ligne

source: ERROR: %s at end of input
fr: ERREUR : %s à la fin de la saisie

source: ERROR: %s before '%s'
fr: ERREUR : %s avant « %s »

source: Bad tree record when decompiling
fr: Mauvais enregistrement de l'arborescence lors de la décompilation

source: Cannot compare non value or bool only matrices
fr: Impossible de comparer des matrices ne comportant que des non valeurs ou des booléens

source: Modulo arithmetic only works on integers
fr: L'arithmétique modulaire ne fonctionne qu'avec des entiers

source: Can't add/subtract a scalar to non-square matrix (A + x is defined as A + x*I)
fr: Impossible d'additionner/soustraire un scalaire à une matrice non carrée (A + x est définie comme A + x*I)

source: Can't add/subtract two matrices of different sizes
fr: Impossible d'ajouter/soustraire deux matrices de tailles différentes

source: Can't do element by element operations on two matrices of different sizes
fr: Impossible d'effectuer des opérations élément par élément sur deux matrices de tailles différentes

source: Can't multiply matrices of wrong sizes
fr: Impossible de multiplier des matrices de mauvaise taille

source: Powers are defined on (square matrix)^(integer) only
fr: Les puissances sont définies seulement pour (matrice carrée)^(entier)

source: Powers on matrices in modulo mode are defined on integer matrices only
fr: Les puissances de matrices dans le mode modulo sont définies pour les matrices d'entiers seulement

source: Exponent too large
fr: L'exposant est trop grand

source: Matrix appears singular and can't be inverted
fr: La matrice est singulière et ne peut être inversée

source: Can't divide matrices of different sizes or non-square matrices
fr: Impossible de diviser des matrices de tailles différentes ou non carrées

source: Can't divide by a non-square matrix
fr: Impossible de diviser par une matrice non carrée

source: Operations on functions with variable argument list not supported
fr: Opérations sur des fonctions comportant une liste variable d'arguments non prises en charge

source: Operations on functions with different number of arguments not supported
fr: Opérations sur des fonctions qui ont un nombre d'arguments différent non prises en charge

source: Function creation with wrong number of arguments
fr: Création de fonction avec un nombre d'arguments incorrect

source: Unevaluatable function type encountered!
fr: Un type de fonction non évaluable a été rencontré.

source: or
fr: ou

source: Variable 'i' used uninitialized. Perhaps you meant to write '1i' for the imaginary number (square root of -1).
fr: La variable « i » n'est pas initialisée. Peut-être vouliez-vous écrire « 1i » pour le nombre imaginaire pur (racine carrée de -1).

source: Variable '%s' used uninitialized, perhaps you meant %s.
fr: La variable « %s » est utilisée sans être initialisée, peut-être vouliez-vous dire %s.

source: Variable '%s' used uninitialized
fr: La variable « %s » est utilisée sans être initialisée

source: Call of '%s' with the wrong number of arguments! (should be %d)
fr: Appel de « %s » avec un mauvais nombre d'arguments (devrait être %d)

source: Trying to dereference '%s' which is not a reference!
fr: Tentative de déréférencer « %s » qui n'est pas une référence

source: NULL reference encountered!
fr: Une référence « NULL » a été rencontrée.

source: Cannot compare matrices
fr: Impossible de comparer des matrices

source: Primitives must get numeric/matrix/string arguments
fr: Les primitives doivent recevoir des arguments numériques/matrices/chaînes

source: Bad argument to modular operation
fr: Argument incorrect pour une opération modulaire

source: Function '%s' used uninitialized, perhaps you meant %s.
fr: La fonction « %s » est utilisée sans être initialisée, peut-être vouliez-vous dire %s.

source: Function '%s' used uninitialized
fr: La fonction « %s » est utilisée sans être initialisée

source: Can't dereference '%s'!
fr: Impossible de déréférencer « %s ».

source: Can't call a non-function!
fr: Impossible d'appeler autre chose qu'une fonction.

source: Call of '%s' with the wrong number of arguments! (should be greater than %d)
fr: Appel de « %s » avec un nombre d'arguments incorrect (devrait être plus grand que %d)

source: Referencing an undefined variable %s!
fr: Référencement d'une variable non définie %s.

source: Reference function with arguments encountered!
fr: Une fonction de référence avec arguments a été rencontrée.

source: Unnamed reference function encountered!
fr: Une fonction de référence sans nom a été rencontrée.

source: Bad type for 'for/sum/prod' loop!
fr: Type non valide pour une boucle « for/sum/prod ».

source: 'for/sum/prod' loop increment can't be 0
fr: L'incrément d'une boucle « for/sum/prod » ne peut être 0

source: Bad type for 'for in' loop!
fr: Type non valide pour une boucle « for in ».

source: Continue or break outside a loop, assuming "return null"
fr: « continue » ou « break » à l'extérieur d'une boucle, « return null » est supposé

source: Wrong argument type as matrix index
fr: Mauvais type d'argument pour un indice de matrice
