Repository: GNOME/genius
Catalog: po/*.po
Languages: fr

source: Limits
fr: Limites

source: When the limit is reached you will be asked if you wish to interrupt the calculation or continue. Setting to 0 disables the limit.
fr: Lorsque la limite est atteinte, il vous sera demandé si vous souhaitez interrompre ou continuer le calcul. Un réglage à 0 désactive la limitation.

source: Maximum number of nodes to allocate
fr: Nombre maximum de nœuds à allouer

source: <b>Genius is currently executing something.</b> Please try again later or interrupt the current operation.
fr: <b>Genius exécute actuellement quelque chose.</b> Essayez à nouveau plus tard ou interrompez l'opération actuelle.

source: GEL files
fr: Fichiers GEL

source: All files
fr: Tous les fichiers

source: Cannot open file!
fr: Impossible d'ouvrir le fichier.

source: Output from
fr: Sortie de

source: End
fr: Fin

source: Load and Run
fr: Charger et lancer

source: _Load
fr: _Charger

source: Cannot open file
fr: Impossible d'ouvrir le fichier

source: Line: %d
fr: Ligne : %d

source: The program you are closing is unsaved, are you sure you wish to close it without saving?
fr: Le programme que vous souhaitez fermer n'est pas enregistré, êtes-vous sûr de vouloir le fermer sans le sauvegarder ?

source: Program_%d.gel
fr: Programme_%d.gel

source: Program %d
fr: Programme %d

source: Cannot open %s
fr: Impossible d'ouvrir %s

source: Open...
fr: Ouvrir...

source: Program is read only
fr: Le fichier est en lecture seule

source: <b>Cannot save file %s</b> Details: %s
fr: <b>Impossible d'enregistrer le fichier %s</b> Détails : %s

source: <b>Cannot save file %s</b>
fr: <b>Impossible d'enregistrer le fichier %s</b>

source: Save new programs by "Save As..." first!
fr: Enregistrez dans un premier temps les nouveaux programmes en utilisant « Enregistrer sous » !

source: Some read-only programs are modified. Use "Save As..." to save them to a new location.
fr: Certains programmes en lecture seule sont modifiés. Utilisez « Enregistrer sous » pour les enregistrer dans un nouvel emplacement.

source: <b>Cannot save file</b> Details: %s
fr: <b>Impossible d'enregistrer le fichier</b> Détails : %s

source: <b>Cannot save file</b>
fr: <b>Impossible d'enregistrer le fichier</b>

source: Save As...
fr: Enregistrement sous...

source: Save Console Output...
fr: Enregistrement de la sortie console...

source: <b>No program selected.</b> Create a new program, or select an existing tab in the notebook.
fr: <b>Aucun programme sélectionné.</b> Créez un nouveau programme ou sélectionnez un onglet existant.

source: Cannot open pipe: %s
fr: Impossible d'ouvrir le « tube » (pipe) : %s

source: <b>Cannot execute program</b> Cannot fork.
fr: <b>Impossible d'exécuter le programme</b> Impossible de créer un nouveau processus (fork).

source: <b>Error executing program</b> There was an error while writing the program to the engine.
fr: <b>Erreur à l'exécution du programme</b> Il s'est produit une erreur lors de l'écriture du programme vers le moteur de calcul.

source: Memory (node number) limit has been reached, interrupt the computation?
fr: La limite mémoire est atteinte (nombre de nœuds), voulez-vous interrompre le calcul ?

source: Can't execute genius-readline-helper-fifo!
fr: Impossible d'exécuter genius-readline-helper-fifo

source: Readline helper died, weird. Trying to recover, things may be odd.
fr: L'assistant d'aide readline a quitté, étrange. Essayez de le relancer, il se peut qu'il se passe des choses bizarres.

source: Note: Compiled without GtkSourceView (better source editor)
fr: Note : compilé sans GtkSourceView (meilleur éditeur de source)

source: Cannot find the library file, genius installation may be incorrect
fr: Impossible de trouver le fichier de bibliothèque, il se peut que l'installation de Genius soit incorrecte

source: %sGenius %s%s %s This is free software with ABSOLUTELY NO WARRANTY. For license details type `%swarranty%s'. For help type `%smanual%s' or `%shelp%s'.%s
fr: %sGenius %s%s %s Ceci est un logiciel libre sans AUCUNE GARANTIE. Pour les détails de la licence, saisissez « %swarranty%s ». Pour une aide, saisissez « %smanual%s » or « %shelp%s ».%s

source: Genius Math Tool
fr: Outil de maths Genius

source: Genius Mathematical Tool and Calculator
fr: Outil de maths et calculatrice Genius

source: Mathematics;Matrix;Vector;Linear Algebra;Calculus;Plot;Plotting;Graph;Graphing;Function;Number Theory;
fr: Mathématiques;Matrice;Vecteur;Algèbre linéaire;Calcul;Tracer;Tracé de graphique;Graphique;Graphisme;Fonction;Théorie des nombres;

source: Rotate
fr: Rotation

source: Rotate about %s axis:
fr: Rotation autour de l'axe %s :

source: Rotate about dependent axis:
fr: Rotation autour de l'axe dépendant :

source: Print
fr: Impression

source: Print command:
fr: Commande d'impression :

source: Cannot open temporary file, cannot print.
fr: Impossible d'ouvrir le fichier temporaire, impossible d'imprimer.

source: Printing failed
fr: Échec de l'impression

source: Printing failed: %s
fr: Échec de l'impression : %s

source: File already exists. Overwrite it?
fr: Le fichier existe déjà. Voulez-vous l'écraser ?

source: Export failed
fr: Échec de l'exportation

source: Export encapsulated postscript
fr: Exportation postscript encapsulé

source: Export postscript
fr: Exportation en postscript

source: Export PDF
fr: Exportation en PDF

source: Export PNG
fr: Exportation en PNG

source: Missing ps2pdf command, perhaps ghostscript is not installed.
fr: Commande ps2pdf absente, Ghostscript n'est peut-être pas installé.

source: EPS files
fr: Fichiers EPS

source: PS files
fr: Fichiers PS

source: PDF files
fr: Fichiers PDF

source: PNG files
fr: Fichiers PNG

source: Generate preview in EPS file (with ps2epsi)
fr: Générer un aperçu dans un fichier EPS (avec ps2epsi)

source: Solver
fr: Solveur

source: Clea_r solutions
fr: E_ffacer les solutions

source: _Plot solution
fr: _Tracer la solution

source: Clicking on the graph window now will draw a solution according to the parameters set below, starting at the point clicked. To be able to zoom by mouse again, close this window.
fr: Un clic sur la fenêtre graphique permet de tracer une solution en respectant les paramètres définis ci-dessous ; le point de départ étant le point cliqué. Pour pouvoir à nouveau faire un zoom à l'aide de la souris, vous devez fermer cette fenêtre.

source: X increment:
fr: Incrément suivant x :

source: T increment:
fr: Incrément suivant t :

source: T interval length:
fr: Longueur de l'intervalle t :

source: Plot
fr: Courbe

source: _Graph
fr: _Graphe

source: _Print...
fr: _Imprimer...

source: _Export postscript...
fr: _Exporter en postscript...

source: E_xport encapsulated postscript...
fr: E_xporter en postscript encapsulé...

source: Export P_DF...
fr: Exporter en P_DF...

source: Export P_NG...
fr: Exporter en P_NG...

source: Zoom _out
fr: Zoom _arrière

source: Zoom _in
fr: Zoom a_vant

source: _Fit dependent axis
fr: _Adapter pour l'axe dépendant

source: _Reset to original zoom
fr: _Réinitialiser le zoom original

source: _View
fr: _Affichage

source: _Reset angles
fr: _Réinitialiser les angles

source: _Top view
fr: Vue du _dessus

source: R_otate axis...
fr: Axe de r_otation...

source: Start rotate _animation...
fr: Lancer l'_animation de rotation...

source: Stop rotate a_nimation...
fr: Arrêter l'a_nimation de rotation...

source: _Solver
fr: _Solveur

source: _Solver...
fr: _Solveur...

source: _Clear solutions
fr: E_ffacer les solutions

source: Errors during plotting (possibly harmless), see the console.
fr: Erreurs lors du tracé de graphique (probablement sans gravité), voir la console.

source: Function
fr: Fonction

source: Function #%d
fr: Fonction n°%d

source: Graph limits not given as a 4-vector
fr: Limites du graphique non fournies sous la forme d'un vecteur à 4 composantes

source: Graph limits not given as numbers
fr: Limites du graphique non fournies sous la forme de nombres

source: Graph limits not given as a 2-vector
fr: Limites du graphique non fournies sous la forme d'un vecteur à 2 composantes

source: Graph limits not given as a 6-vector
fr: Limites du graphique non fournies sous la forme d'un vecteur à 6 composantes

source: Ticks must be between 2 and 200
fr: Les traits doivent être compris entre 2 et 200

source: Ticks not given as numbers
fr: Les traits ne sont pas fournis sous la forme de nombres

source: Ticks not given as a number or a 2-vector
fr: Les traits ne sont pas fournis sous la forme de nombres ou d'un vecteur à 2 lignes

source: Type in function name or expression involving the %s and %s variables (or the %s variable which will be %s=%s+i%s) that gives the slope at the point (%s,%s).
fr: Saisissez un nom de fonction ou une expression comportant les variables %s et %s (ou la variable %s qui sera traitée comme %s=%s+i%s) qui permet de calculer la pente au point (%s,%s).

source: %s from:
fr: %s de :

source: %s increment:
fr: Incrément pour %s :

source: %s interval length:
fr: Longueur de l'intervalle %s :

source: Type in function names or expressions involving the %s and %s variables (or the %s variable which will be %s=%s+i%s) that give the d%s/d%s and d%s/d%s of the autonomous system to be plotted at the point (%s,%s).
fr: Saisissez des noms de fonctions ou des expressions en utilisant les variables %s et %s (ou la variable %s qui sera traitée comme %s=%s+i%s) qui permet de calculer d%s/d%s et d%s/d%s du système autonome à tracer au point (%s,%s).

source: Type in function names or expressions involving the %s variable in the boxes below to graph them
fr: Saisissez des noms de fonctions ou des expressions en utilisant la variable %s dans les boîtes ci-dessous pour les dessiner.

source: Type in function names or expressions involving the %s variable in the boxes below to graph them. Either fill in both boxes with %s= and %s= in front of them giving the %s and %s coordinates separately, or alternatively fill in the %s= box giving %s and %s as the real and imaginary part of a complex number.
fr: Saisissez des noms de fonctions ou des expressions en utilisant la variable %s dans les boîtes ci-dessous pour les dessiner. Renseignez les boîtes %s= et %s= pour préciser séparément les coordonnées %s et %s, ou bien renseignez la boîte %s= en précisant %s et %s respectivement comme la partie réelle et la partie imaginaire d'un nombre complexe.

source: Parameter %s from:
fr: Paramètre %s de :

source: Type a function name or an expression involving the %s and %s variables (or the %s variable which will be %s=%s+i%s) in the boxes below to graph them. Functions with one argument only will be passed a complex number.
fr: Saisissez un nom de fonction ou une expression utilisant les variables %s et %s (ou la variable %s qui sera traitée comme %s=%s+i%s) dans les boîtes ci-dessous pour les dessiner. Un nombre complexe sera transmis aux fonctions ne comportant qu'un seul argument.

source: Change variable names
fr: Modification des noms des variables

source: Some values were illegal
fr: Certaines valeurs sont illégales

source: independent variable (x):
fr: variable indépendante (x) :

source: dependent variable (y):
fr: variable dépendante (y) :

source: complex variable (z = x+iy):
fr: variable complexe (z = x+iy) :

source: parameter variable (t):
fr: variable paramètre (t) :

source: independent variable (y):
fr: variable indépendante (y) :

source: independent complex variable (z = x+iy):
fr: variable indépendante complexe (z = x+iy) :

source: _Functions / Expressions
fr: _Fonctions / Expressions

source: Parameter t from:
fr: Paramètre t de :

source: to:
fr: à :

source: by:
fr: par pas de :

source: Pa_rametric
fr: Courbe pa_ramétrique

source: Vertical ticks:
fr: Traits verticaux :

source: Horizontal ticks:
fr: Traits horizontaux :

source: Sl_ope field
fr: Champ de _directions

source: _Normalize arrow length (do not show size)
fr: _Normaliser la longueur des flèches (ne pas afficher la taille)

source: _Vector field
fr: Champ de _vecteurs

source: _Draw legend
fr: _Dessiner la légende

source: Draw axis labels
fr: Dessiner les étiquettes des axes

source: Change variable names...
fr: Modifier les noms des variables...

source: Plot Window
fr: Fenêtre du tracé

source: X from:
fr: X de :

source: Y from:
fr: Y de :

source: Fit dependent axis
fr: Adapter l'axe dépendant

source: Function / Expression
fr: Fonction / Expression

source: Dependent axis from:
fr: Axe dépendant de :

source: Function _line plot
fr: Tracé de _courbes

source: _Surface plot
fr: Tracé de _surface

source: No functions to plot or no functions could be parsed
fr: Pas de fonctions à tracer ou aucune fonction n'a pu être analysée

source: Invalid %s range
fr: Intervalle %s non valide

source: Invalid dependent range
fr: Intervalle dépendant non valide

source: Only specify %s and %s, or %s, not all at once.
fr: Spécifiez seulement %s et %s, ou bien %s mais pas les deux.

source: Create Plot
fr: Création de graphique

source: %s: Plotting in progress, cannot call %s
fr: %s : tracé en cours, impossible d'appeler %s

source: %s: argument not a function
fr: %s : l'argument n'est pas une fonction

source: %s: only one function supported
fr: %s : seul une fonction est prise en charge

source: Graph limits not given as a 4-vector or a 6-vector
fr: Limites du graphique non fournies sous la forme d'un vecteur à 4 ou 6 composantes

source: %s: invalid X range
fr: %s : intervalle X non valide

source: %s: invalid Y range
fr: %s : intervalle Y non valide

source: %s: invalid Z range
fr: %s : intervalle Z non valide

source: %s: dx must be positive
fr: %s : dx doit être positif

source: %s: Slope field not active
fr: %s : champ de directions non actif

source: %s: dt must be positive
fr: %s : dt doit être positif

source: %s: tlen must be positive
fr: %s : tlen doit être positif

source: %s: Vector field not active
fr: %s : champ de vecteurs non actif

source: %s: First argument must be a function
fr: %s : le premier argument doit être une fonction

source: %s: First two arguments must be functions
fr: %s : les deux premiers arguments doivent être des fonctions

source: %s: only up to 10 functions supported
fr: %s : seulement 10 fonctions prises en charge

source: Graph limits not given as a 2-vector or a 4-vector
fr: Limites du graphique non fournies sous la forme d'un vecteur à 2 ou 4 composantes

source: %s: invalid T range
fr: %s : intervalle T non valide

source: %s: Not in line plot mode. Perhaps run LinePlot or LinePlotClear first.
fr: %s : N'est pas en tracé de courbe. Il faut peut-être exécuter LinePlot ou LinePlotClear d'abord.

source: %s: Points should be given as a real, n by 2 matrix with columns for x and y, n>=%d, or as a complex valued n by 1 matrix
fr: %s : les points doivent être donnés par une matrice (de taille n par 2) réelle dont les colonnes sont x et y, avec n >= %d, ou une matrice complexe n par 1

source: %s: If points are given as an n by 2 matrix, then this matrix must be real
fr: %s : si les points sont donnés par une matrice n par 2, alors cette matrice doit être réelle

source: %s: Points should be given as a real, n by 3 matrix with columns for x, y and z, n>=%d
fr: %s : les points doivent être donnés par une matrice (de taille n par 2) réelle dont les colonnes sont x, y et z, avec n >= %d

source: %s: No color specified
fr: %s : aucune couleur indiquée

source: %s: Cannot parse color '%s'
fr: %s : impossible d'analyser la couleur « %s »

source: %s: A vector giving color should be a 3-vector of real numbers between 0 and 1
fr: %s : un vecteur donnant des couleurs doit être un vecteur à 3 composantes de nombres réels entre 0 et 1

source: %s: Warning: Values for red, green, or blue out of range (0 to 1), I will clip them to this interval
fr: %s : Avertissement : les valeurs pour le rouge, le vert ou le bleu en dehors de l'intervalle 0 - 1 vont être réduites à cet intervalle

source: %s: Color must be a string or a three-vector of rgb values (between 0 and 1)
fr: %s : la couleur doit être une chaîne ou un vecteur à trois composantes de valeurs RVB (entre 0 et 1)

source: %s: Wrong number of arguments
fr: %s : nombre d'arguments non valide

source: %s: No thickness specified
fr: %s : aucune épaisseur indiquée

source: %s: No window specified
fr: %s : aucune fenêtre indiquée

source: %s: arrow style should be "origin", "end", "both", or "none"
fr: %s : le style des flèches doit être "origin", "end", "both" ou "none"

source: %s: No legend specified
fr: %s : aucune légende indiquée

source: %s: Legend must be a string
fr: %s : la légende doit être une chaîne

source: %s: Unknown style: %s
fr: %s : style inconnu : %s

source: %s: Bad parameter
fr: %s : mauvais paramètre

source: %s: Unknown style
fr: %s : style inconnu

source: %s: Surface should be given as a real, n by 3 matrix with columns for x, y, z, where n>=3
fr: %s : une ligne doit être donnée par une matrice de taille n par 3 réelle dont les colonnes sont x, y, z, avec n >= 3

source: %s: argument not a matrix of data
fr: %s : l'argument n'est pas une matrice de données

source: %s: Surface grid data should be given as a real matrix
fr: %s : les grilles de données de surface doivent être données par une matrice réelle

source: %s: first argument not a matrix of data
fr: %s : le premier argument n'est pas une matrice de données

source: %s: second argument not a 4 or 6 element vector of limits
fr: %s : le deuxième argument n'est pas un vecteur de limites à 4 ou 6 composabnts

source: %s: too many arguments or last argument not a string label
fr: %s : trop d'arguments ou le dernier argument n'est pas une étiquette de chaîne

source: %s: first argument not a nonempty string
fr: %s : le premier argument n'est pas une chaîne non vide

source: %s: type not specified and filename has no extension
fr: %s : le type n'est pas spécifié et le nom de fichier n'a pas d'extension

source: %s: second argument not a nonempty string
fr: %s : le deuxième argument n'est pas une chaîne non vide

source: %s: plot canvas not active, cannot export
fr: %s ; le canevas de tracé n'est pas actif, impossible d'exporter

source: %s: export failed
fr: %s : échec de l'exportation

source: %s: unknown file type, can be "png", "eps", or "ps".
fr: %s : le type de fichier est inconnu, ce peut être « png », « eps » ou « ps »

source: Variable names not given in a 4-vector
fr: Noms des variables non fournis sous la forme d'un vecteur à 4 composantes

source: Variable names should be strings
fr: Les noms des variables doivent être des chaînes de caractères

source: Variable names must be valid identifiers
fr: Les noms des variables doivent être des identifiants valides

source: Variable names must be mutually distinct
fr: Les noms des variables doivent être tous différents

source: Variable names not given in a 3-vector
fr: Noms des variables non fournis sous la forme d'un vecteur à 3 composantes

source: Plotting
fr: Tracé de ligne

source: Plot a function with a line. First come the functions (up to 10) then optionally limits as x1,x2,y1,y2
fr: Dessine une fonction avec une ligne. D'abord viennent les fonctions (jusqu'à 10) puis en option les limites sous la forme x1,x2,y1,y2

source: Plot a parametric function with a line. First come the functions for x and y then optionally the t limits as t1,t2,tinc, then optionally the limits as x1,x2,y1,y2
fr: Dessine une fonction paramétrique avec une ligne. D'abord viennent les fonctions de x et y puis en option les limites pour t sous la forme t1,t2, tinc puis, en option, les limites sous la forme x1,x2,y1,y2

source: Plot a parametric complex valued function with a line. First comes the function that returns x+iy then optionally the t limits as t1,t2,tinc, then optionally the limits as x1,x2,y1,y2
fr: Dessine une fonction paramétrique complexe avec une ligne. D'abord vient la fonction qui renvoie x+iy puis, en option, les limites t sous la forme t1,t2,tinc puis, en option, les limites sous la forme x1,x2,y1,y2

source: Draw a slope field. First comes the function dy/dx in terms of x and y (or a complex z) then optionally the limits as x1,x2,y1,y2
fr: Trace un champ de directions. D'abord vient la fonction dy/dx en terme de x et y (ou d'un complexe z) puis, en option, les limites sous la forme x1,x2,y1,y2

source: Draw a vector field. First come the functions dx/dt and dy/dt in terms of x and y then optionally the limits as x1,x2,y1,y2
fr: Dessine un champ de vecteurs. D'abord viennent les fonctions dx/dt et dy/dt en terme de x et y puis, en option, les limites sous la forme x1,x2,y1,y2

source: Draw a solution for a slope field starting at x,y and using dx as increment
fr: Trace une solution pour un champ de directions commençant en x,y et en utilisant l'incrément dx

source: Clear all the slopefield solutions
fr: Efface toutes les solutions du champ de directions

source: Draw a solution for a vector field starting at x,y, using dt as increment for tlen units
fr: Trace une solution pour un champ de vecteurs commençant en x,y et en utilisant l'incrément dt pendant tlen unités

source: Clear all the vectorfield solutions
fr: Efface toutes les solutions de champ de vecteurs

source: Plot a surface function which takes either two arguments or a complex number. First comes the function then optionally limits as x1,x2,y1,y2,z1,z2
fr: Dessine une surface qui prend soit deux arguments ou un seul argument complexe. D'abord vient la fonction puis en option les limites sous la forme x1,x2,y1,y2,z1,z2

source: Show the surface (3d) plot window and clear out functions
fr: Affiche la fenêtre de tracé de surface (3d) et efface les fonctions

source: Plot surface data given as n by 3 matrix (n>=3) of data with each row being x,y,z. Optionally can pass a label string and limits. If no limits passed, limits computed from data.
fr: Dessine les données de surfaces fournies par une matrice de données n par 3 (n>=3), chaque ligne étant x, y, z. Le passage d'une chaîne d'étiquette et de limites est possible sur options.

source: Plot surface data given as a matrix (where rows are the x coordinate and columns are the y coordinate), the limits are given as [x1,x2,y1,y2] or optionally [x1,x2,y1,y2,z1,z2], and optionally a string for the label.
fr: Dessine les données de surface fournies par une matrice (où les lignes sont la coordonnée x et les colonnes la coordonnée y), les limites sont données par [x1,x2,y1,y2] ou sur option [x1,x2,y1,y2,z1,z2], et facultativement une chaîne pour l'étiquette.

source: Draw a line from x1,y1,z1 to x2,y2,z2 on the surface (3d) plot. x1,y1,z1,x2,y2,z2 can be replaced by a n by 3 matrix for a longer line
fr: Trace une ligne de x1,y1,z1 à x2,y2,z2 sur le tracé de surface (3d). x1,y1,z1x2,y2,z2 peuvent être remplacées par une matrice n par 3 pour une ligne plus longue

source: Draw a point at x,y,z on the surface (3d) plot. x,y,z can be replaced by a n by 3 matrix for more points.
fr: Dessine un point à x, y, z sur le tracé de surface (3d). x,y,z peuvent être remplacées par une matrice n par 3 pour plus de points.

source: Show the line plot window and clear out functions
fr: Affiche la fenêtre graphique et efface les fonctions

source: Draw a line from x1,y1 to x2,y2. x1,y1,x2,y2 can be replaced by a n by 2 matrix for a longer line.
fr: Trace une ligne de x1,y1 à x2,y2. x1,y1,x2,y2 peuvent être remplacées par une matrice n par 2 pour une ligne plus longue.

source: Draw a point at x,y. x,y can be replaced by a n by 2 matrix for more points.
fr: Dessine un point à x,y. x,y peuvent être remplacées par une matrice n par 2 pour plus de points

source: Freeze the plot canvas, that is, inhibit drawing
fr: Gèle le canevas, c.-à.d inhibe le dessin

source: Thaw the plot canvas and redraw the plot immediately
fr: Rejette le canevas de tracé et redessine le canevas aussitôt
