Repository: GNOME/genius
Catalog: po/*.po
Languages: fr

source: Compose two functions
fr: Compose deux fonctions

source: Compose a function with itself n times, passing x as argument, and returning x if n == 0
fr: Compose une fonction n fois avec elle-même. L'argument de la fonction est x. La fonction renvoie x si n == 0

source: Print a table of values for f(n) for numbers from vector v, or if v is a number for integers from 1 to v
fr: Affiche un tableau de valeurs pour f(n) pour les nombres du vecteur v, ou si v est un nombre pour les entiers de 1 à v

source: Make a string
fr: Construit une chaîne

source: Tolerance of the Chop function
fr: Tolérance de la fonction Chop

source: How many iterations to try to find the limit for continuity and limits
fr: Nombre d'itérations à essayer pour trouver la continuité et les limites d'une fonction

source: How many successive steps to be within tolerance for calculation of continuity
fr: Nombre d'étapes successives pour atteindre la tolérance pour le calcul de la continuité

source: Tolerance for continuity of functions and for calculating the limit
fr: Tolérance pour la continuité d'une fonction et pour le calcul de la limite

source: How many iterations to try to find the limit for derivative
fr: Nombre d'itérations à essayer pour trouver la limite pour la dérivée

source: How many successive steps to be within tolerance for calculation of derivative
fr: Nombre d'étapes successives pour atteindre la tolérance pour le calcul de la dérivée

source: Tolerance for calculating the derivatives of functions
fr: Tolérance pour le calcul de la dérivée des fonctions

source: Tolerance of the ErrorFunction (used for complex values only)
fr: Tolérance de la fonction ErrorFunction (utilisée uniquement pour les valeurs complexes)

source: Tolerance of the GaussDistribution function
fr: Tolérance de la fonction GaussDistribution

source: The function used for numerical integration in NumericalIntegral
fr: Fonction utilisée pour l'intégration numérique dans la fonction NumericalIntegral

source: Steps to perform in NumericalIntegral
fr: Étapes à réaliser dans NumericalIntegral

source: How many iterations to try for InfiniteSum and InfiniteProduct
fr: Nombre d'itérations à essayer pour les fonctions InfiniteSum et InfiniteProduct

source: How many successive steps to be within tolerance for InfiniteSum and InfiniteProduct
fr: Nombre d'étapes successives pour atteindre la tolérance pour les fonctions InfiniteSum et InfiniteProduct

source: Tolerance for InfiniteSum and InfiniteProduct
fr: Tolérance pour les fonctions InfiniteSum et InfiniteProduct

source: Absolute value
fr: Valeur absolue

source: Replace very small number with zero
fr: Remplace les très petits nombres par zéro

source: Return the fractional part of a number
fr: Renvoie la partie fractionnelle d'un nombre

source: Return the sign (-1,0,1)
fr: Renvoie le signe (-1,0,1)

source: Logarithm of any base (calls DiscreteLog if in modulo mode), if base is not given, e is used
fr: Logarithme de n'importe quelle base (appelle DiscreteLog dans le mode modulo). Si la base n'est pas donnée, e est utilisée

source: The arccos (inverse cos) function
fr: Fonction arccos (arc cosinus)

source: The arccosh (inverse cosh) function
fr: Fonction arccosh (cosinus hyperbolique inverse)

source: The arccot (inverse cot) function
fr: Fonction arccot (cotangente inverse)

source: The arccoth (inverse coth) function
fr: Fonction arccoth (cotangente hyperbolique inverse)

source: The inverse cosecant function
fr: Inverse de la fonction cosécante

source: The inverse hyperbolic cosecant function
fr: Inverse de la fonction cosécante hyperbolique

source: The inverse secant function
fr: Inverse de la fonction sécante

source: The inverse hyperbolic secant function
fr: Inverse de la fonction sécante hyperbolique

source: The arcsin (inverse sin) function
fr: Fonction arcsin (arc sinus)

source: The arcsinh (inverse sinh) function
fr: Fonction arcsinh (sinus hyperbolique inverse)

source: The arctanh (inverse tanh) function
fr: Fonction arctanh (tangente hyperbolique inverse)

source: The cotangent function
fr: Fonction cotangente

source: The hyperbolic cotangent function
fr: Fonction cotangente hyperbolique

source: The cosecant function
fr: Fonction cosécante

source: The hyperbolic cosecant function
fr: Fonction cosécante hyperbolique

source: The secant function
fr: Fonction sécante

source: The hyperbolic secant function
fr: Fonction sécante hyperbolique

source: The hyperbolic tangent function
fr: Fonction tangente hyperbolique

source: Are a and b relatively prime?
fr: a et b sont-ils premiers entre eux ?

source: Return the nth Bernoulli number
fr: Renvoie le n-ième nombre de Bernoulli

source: Find the x that solves the system given by the vector a and modulo the elements of m, using the Chinese Remainder Theorem
fr: Cherche x qui vérifie le système défini par le vecteur a et modulo les éléments de m, en utilisant le théorème des restes chinois

source: Given two factorizations, give the factorization of the product, see Factorize
fr: Étant données deux factorisations, donne la factorisation du produit. Voir Factorize

source: Convert a vector of values indicating powers of b to a number
fr: Convertit un vecteur de valeurs indiquant les puissances de b en un nombre

source: Convert a number to a vector of powers for elements in base b
fr: Convertit un nombre en un vecteur contenant les puissances des éléments dans la base b

source: Find discrete log of n base b in F_q where q is a prime using the Silver-Pohlig-Hellman algorithm
fr: Calcule le logarithme discret de n en base b dans F_q où q est un nombre premier, en utilisant l'algorithme de Silver-Pohlig-Hellman

source: Compute phi(n), the Euler phi function, that is the number of integers between 1 and n relatively prime to n
fr: Calcule la fonction Euler phi(n), c'est-à-dire le nombre d'entiers compris entre 1 et n premiers avec n

source: Return all factors of a number
fr: Renvoie tous les facteurs d'un nombre

source: Attempt Fermat factorization of n into (t-s)*(t+s), returns t and s as a vector if possible, null otherwise
fr: Tente la factorisation de Fermat de n sous la forme (t-s)*(t+s), si c'est possible renvoie t et s sous la forme d'un vecteur sinon renvoie « null »

source: Find the first primitive element in F_q (q must be a prime)
fr: Cherche le premier élément primitif dans F_q (q doit être premier)

source: Find a random primitive element in F_q (q must be a prime)
fr: Cherche un élément primitif au hasard dans F_q (q doit être premier)

source: Compute discrete log base b of n in F_q (q a prime) using the factor base S. S should be a column of primes possibly with second column precalculated by IndexCalculusPrecalculation.
fr: Calcule le logarithme discret de n en base b dans F_q en utilisant la base de facteur S. S doit être une colonne de nombres premiers avec éventuellement la deuxième colonne pré-calculée par IndexCalculusPrecalculation.

source: Run the precalculation step of IndexCalculus for logarithms base b in F_q (q a prime) for the factor base S (where S is a column vector of primes). The logs will be precalculated and returned in the second column.
fr: Lance l'étape de calcul préliminaire de IndexCalculus pour le logarithme base b dans F_q (q est un nombre premier), pour la base de facteur S où S doit être une colonne de nombres premiers. Les logarithmes sont pré-calculés et renvoyés dans la deuxième colonne.

source: Test if Mp is a Mersenne prime using a table
fr: Teste si Mp est un nombre premier de Mersenne en utilisant une table

source: Tests if a rational number is a perfect power
fr: Vérifie si un nombre rationnel est une puissance parfaite

source: Check if g is primitive in F_q, where q is a prime. If q is not prime results are bogus.
fr: Vérifie que g est primitif dans F_q où q est premier. Si q n'est pas premier, les résultats sont erronés.

source: Check if g is primitive in F_q, where q is a prime and f is a vector of prime factors of q-1. If q is not prime results are bogus.
fr: Vérifie que g est primitif dans F_q où q est premier et f est un vecteur de facteurs premiers de q-1. Si q n'est pas premier, les résultats sont erronés.

source: If n is a pseudoprime base b but not a prime, that is if b^(n-1) == 1 mod n
fr: Si n est un nombre pseudopremier en base b mais pas un nombre premier, c'est-à-dire si b^(n-1) == 1 modulo n

source: Test if n is a strong pseudoprime to base b but not a prime
fr: Test si n est un nombre pseudopremier fort en base b mais pas un nombre premier

source: Return the residue of a mod n with the least absolute value (in the interval -n/2 to n/2)
fr: Renvoie le résidu de a modulo n avec la plus petite valeur absolue (entre -n/2 et n/2)

source: Test if Mp is a Mersenne prime using the Lucas-Lehmer test
fr: Teste si p est un nombre premier de Mersenne en utilisant le test de Lucas-Lehmer

source: Return all maximal prime power factors of a number
fr: Renvoie toutes les puissances premières d'un nombre

source: Vector with the known Mersenne prime exponents
fr: Vecteur contenant les exposants premiers de Mersenne connus

source: Return the Moebius mu function evaluated in n
fr: Renvoie la valeur de la fonction de Moebius mu pour n

source: Returns the p-adic valuation (number of trailing zeros in base p).
fr: Renvoie la valuation p-adic (nombre de zéros après la virgule en base p).

source: Compute a^b mod m
fr: Calcule a^b modulo m

source: Return all prime factors of a number
fr: Renvoie tous les facteurs premiers d'un nombre

source: Pseudoprime test, true if and only if b^(n-1) == 1 (mod n)
fr: Test si le nombre est pseudopremier, vrai si et seulement si b^(n-1) == 1 (mod n)

source: Removes all instances of the factor m from the number n
fr: Élimine toutes les instances du facteur m dans le nombre n

source: Find discrete log of n base b in F_q where q is a prime using the Silver-Pohlig-Hellman algorithm, given f being the factorization of q-1
fr: Calcule le logarithme discret de n en base b dans F_q où q est un nombre premier, en utilisant l'algorithme de Silver-Pohlig-Hellman, sachant que f est la factorisation de q-1

source: Find square root of n mod p (a prime). Null is returned if not a quadratic residue.
fr: Cherche la racine carré de n modulo p (nombre premier). Renvoie « null » si ce n'est pas un résidu quadratique.

source: Apply a function over all entries of a matrix and return a matrix of the results
fr: Applique une fonction sur tous les éléments d'une matrice et renvoie une matrice des résultats

source: Apply a function over all entries of 2 matrices (or 1 value and 1 matrix) and return a matrix of the results
fr: Applique une fonction sur tous les éléments de 2 matrices (ou 1 valeur et 1 matrice) et renvoie une matrice des résultats

source: Remove column(s) and row(s) from a matrix
fr: Supprime certaines colonnes et lignes d'une matrice

source: Calculate the kth compound matrix of A
fr: Calcule la k-ième matrice composée de A

source: Delete a column of a matrix
fr: Supprime une colonne d'une matrice

source: Delete a row of a matrix
fr: Supprime une ligne d'une matrice

source: Get the dot product of two vectors (no conjugates)
fr: Renvoie le produit scalaire de deux vecteurs (pas de conjugaison)

source: Zero out entries above the diagonal
fr: Mets à zéro les éléments au dessus de la diagonale

source: Make diagonal matrix from a vector
fr: Construit une matrice diagonale à partir d'un vecteur

source: Make column vector out of matrix by putting columns above each other
fr: Construit un vecteur colonne à partir d'une matrice en mettant les colonnes les unes au dessus des autres

source: Calculate the product of all elements in a matrix
fr: Calcule le produit de tous les éléments d'une matrice

source: Calculate the sum of all elements in a matrix
fr: Calcule la somme de tous les éléments d'une matrice

source: Calculate the sum of squares of all elements in a matrix
fr: Calcule la somme du carré de tous les éléments d'une matrice

source: Get the outer product of two vectors
fr: Renvoie le produit tensoriel de deux vecteurs

source: Reverse elements in a vector
fr: Inverse l'ordre des éléments d'un vecteur

source: Calculate sum of each row in a matrix
fr: Calcule la somme de chaque ligne d'une matrice

source: Calculate sum of squares of each row in a matrix
fr: Calcule la somme des carrés de chaque ligne d'une matrice

source: Shuffle elements in a vector
fr: Mélange les éléments d'un vecteur

source: Sort vector elements
fr: Trie les éléments d'un vecteur

source: Removes any all-zero rows of M
fr: Élimine toutes les lignes entièrement nulles de M

source: Return column(s) and row(s) from a matrix
fr: Renvoie certaines colonnes et lignes d'une matrice

source: Swap two rows in a matrix
fr: Échange deux lignes dans une matrice

source: Zero out entries below the diagonal
fr: Mets à zéro les éléments en dessous de la diagonale

source: Get the auxiliary unit matrix of size n
fr: Renvoie la matrice unitaire auxiliaire de taille n

source: Evaluate (v,w) with respect to the bilinear form given by the matrix A
fr: Évalue (v,w) par rapport à la forme bilinéaire donnée par la matrice A

source: Return a function that evaluates two vectors with respect to the bilinear form given by A
fr: Renvoie une fonction qui évalue deux vecteurs par rapport à la forme bilinéaire donnée par A

source: Get the characteristic polynomial as a vector
fr: Renvoie le polynôme caractéristique sous la forme d'un vecteur

source: Get the characteristic polynomial as a function
fr: Renvoie le polynôme caractéristique sous la forme d'une fonction

source: Get a basis matrix for the columnspace of a matrix
fr: Retourne une matrice de base pour l'espace vectoriel engendré par les colonnes d'une matrice

source: Return the commutation matrix K(m,n) which is the unique m*n by m*n matrix such that K(m,n) * MakeVector(A) = MakeVector(A.') for all m by n matrices A.
fr: Renvoie la matrice de permutation K(m,n) qui est l'unique matrice m*n par m*n telle que K(m,n) * MakeVector(A) = MakeVector(A.') pour toutes matrices A de taille m par n.

source: Companion matrix of a polynomial (as vector)
fr: Matrice compagnon d'un polynôme (comme vecteur)

source: Conjugate transpose of a matrix (adjoint)
fr: Transposée conjuguée d'une matrice (matrice adjointe)

source: Calculate convolution of two horizontal vectors
fr: Calcule la convolution de deux vecteurs horizontaux

source: CrossProduct of two vectors in R^3
fr: Produit vectoriel de deux vecteurs dans R^3

source: Get the determinantal divisors of an integer matrix
fr: Renvoie les « determinantal divisors » d'une matrice d'entiers

source: Direct sum of matrices
fr: Somme directe de matrices

source: Direct sum of a vector of matrices
fr: Somme directe d'un vecteur de matrices

source: Get the eigenvalues of a matrix (Currently only for up to 4x4 or triangular matrices)
fr: Renvoie les valeurs propres d'une matrice (pour le moment, seulement pour les matrices jusqu'à 4x4 ou bien triangulaires)

source: Get the eigenvalues and eigenvectors of a matrix (Currently only for up to 2x2 matrices)
fr: Renvoie les vecteurs et valeurs propres d'une matrice (pour le moment, seulement pour les matrices 2x2)

source: Apply the Gram-Schmidt process (to the columns) with respect to inner product given by B (if not given use Hermitian product)
fr: Applique le procédé de Gram-Schmidt (aux colonnes) par rapport au produit scalaire donné par B (si non fourni utilise le produit hermitien)

source: Hankel matrix
fr: Matrice de Hankel

source: Hilbert matrix of order n
fr: Matrice de Hilbert d'ordre n

source: Get the image (columnspace) of a linear transform
fr: Renvoie l'image (espace vectoriel engendré par les colonnes) d'une transformation linéaire

source: Get the Inf Norm of a vector
fr: Renvoie la norme Inf d'un vecteur

source: Get the invariant factors of a square integer matrix
fr: Renvoie les facteurs invariants d'une matrice entière carrée

source: Inverse Hilbert matrix of order n
fr: Matrice inverse de Hilbert d'ordre n

source: Is a matrix Hermitian
fr: Vérifie qu'une matrice est hermitienne

source: Test if a vector is in a subspace
fr: Teste si un vecteur appartient à un sous-espace

source: Is a matrix (or number) invertible (Integer matrix is invertible if and only if it is invertible over the integers)
fr: Vérifie qu'une matrice (ou un nombre) est inversible (une matrice entière est inversible si et seulement si elle est inversible sur les entiers)

source: Is a matrix (or number) invertible over a field
fr: Vérifie qu'une matrice (ou un nombre) est inversible sur un type

source: Is a matrix normal
fr: Vérifie que la matrice est normale

source: Is a matrix positive definite
fr: Vérifie que la matrice est définie positive

source: Is a matrix positive semidefinite
fr: Vérifie qu'une matrice est semi-définie positive

source: Is a matrix skew-Hermitian
fr: Vérifie que la matrice est anti-hermitienne

source: Is a matrix unitary
fr: Vérifie que la matrice est unitaire

source: Get the Jordan block corresponding to lambda and n
fr: Renvoie le bloc de Jordan correspondant à lambda et n

source: Get the kernel (nullspace) of a linear transform
fr: Renvoie le noyau d'une application linéaire f : ker(f)

source: Compute the Kronecker product of two matrices
fr: Calcule le produit Kronecker de deux matrices

source: Get the LU decomposition of A and store the result in the L and U which should be references. If not possible returns false.
fr: Renvoie la décomposition LU de A et stocke le résultat dans L et U qui doivent être référencés. Si c'est impossible, renvoie false (faux).

source: Get the i-j minor of a matrix
fr: Renvoie le mineur i-j d'une matrice

source: Return the columns that are not the pivot columns of a matrix
fr: Renvoie les colonnes qui ne sont pas les colonnes pivot d'une matrice

source: Get the p Norm (or 2 Norm if no p is supplied) of a vector
fr: Renvoie la norme-p d'un vecteur (ou norme-2 si p n'est pas fourni)

source: Get the nullity of a matrix
fr: Renvoie la dimension du noyau d'une matrice

source: Get the orthogonal complement of the columnspace
fr: Renvoie le complément orthogonal de l'espace des colonnes

source: Projection of vector v onto subspace W given a sesquilinear form B (if not given use Hermitian product)
fr: Projection du vecteur v sur le sous-espace W étant donné une forme sesquilinéaire B (si non fournie, utilise le produit hermitien)

source: Get the QR decomposition of A, returns R and Q can be a reference
fr: Renvoie la décomposition QR de A, les sorties R et Q peuvent être référencées

source: Get the rank of a matrix
fr: Renvoie le rang d'une matrice

source: Return the Rayleigh quotient of a matrix and a vector
fr: Renvoie le quotient de Rayleigh d'une matrice ou d'un vecteur

source: Compute an eigenvalue using the Rayleigh Quotient Iteration method until we are epsilon from eigenvalue or for maxiter iterations
fr: Calcule une valeur propre en utilisant la méthode itérative du quotient de Rayleigh jusqu'à être à epsilon de la valeur propre ou atteindre l'itération maxiter

source: Rosser matrix, a classic symmetric eigenvalue test problem
fr: Matrice de Rosser, un problème classique de test de valeurs propres symétriques

source: Rotation around origin in R^2
fr: Rotation autour de l'origine dans R^2

source: Rotation around origin in R^3 about the x-axis
fr: Rotation autour de l'origine dans R^3 autour de l'axe des x

source: Rotation around origin in R^3 about the y-axis
fr: Rotation autour de l'origine dans R^3 autour de l'axe des y

source: Rotation around origin in R^3 about the z-axis
fr: Rotation autour de l'origine dans R^3 autour de l'axe des z

source: Get a basis matrix for the rowspace of a matrix
fr: Renvoie une matrice de base pour l'espace vectoriel engendré par les lignes d'une matrice

source: Evaluate (v,w) with respect to the sesquilinear form given by the matrix A
fr: Évalue (v, w) par rapport à la forme sesquilinéaire donnée par la matrice A

source: Return a function that evaluates two vectors with respect to the sesquilinear form given by A
fr: Renvoie une fonction qui évalue deux vecteurs par rapport à la forme sesquilinéaire donnée par A

source: Smith Normal Form for fields (will end up with 1's on the diagonal)
fr: Forme normale de Smith pour les champs (comporte des 1 sur la diagonale)

source: Smith Normal Form for square integer matrices
fr: Forme normale de Smith pour les matrices entières carrées

source: Return the Toeplitz matrix constructed given the first column c and (optionally) the first row r.
fr: Renvoie la matrice de Toeplitz construite à partir de la première colonne c et (en option) la première ligne r.

source: Calculate the trace of a matrix
fr: Calcule la trace d'une matrice

source: Transpose of a matrix
fr: Transposée d'une matrice

source: Return the Vandermonde matrix
fr: Renvoie la matrice de Vandermonde

source: The angle of two vectors, given an inner product
fr: Angle entre deux vecteurs, étant donné un produit scalaire

source: The direct sum of the vector spaces M and N
fr: Somme directe des espaces vectoriels M et N

source: Intersection of the subspaces given by M and N
fr: Intersection des sous-espaces donnés par M et N

source: The sum of the vector spaces M and N, that is {w | w=m+n, m in M, n in N}
fr: Somme des espaces vectoriels M et N, c'est-à-dire {w | w=m+n, m dans M, n dans N}

source: Get the classical adjoint (adjugate) of a matrix
fr: Renvoie la matrice adjointe d'une matrice

source: Compute the Column Reduced Echelon Form
fr: Calcule la forme échelonnée réduite en colonnes

source: Get nth Catalan number
fr: Renvoie le n-ième nombre catalan

source: Double factorial: n(n-2)(n-4)...
fr: Double factorielle : n(n-2)(n-4)...

source: Factorial: n(n-1)(n-2)...
fr: Factoriel : n(n-1)(n-2)...

source: Falling factorial: (n)_k = n(n-1)...(n-(k-1))
fr: Factorielle décroissante : (n)_k·=·n(n-1)...(n-(k-1))

source: Calculate nth Fibonacci number
fr: Calcule le n-ième nombre de Fibonacci

source: Calculate the Frobenius number for a coin problem
fr: Calcule le nombre de Frobenius pour le problème de la pièce d'argent

source: Galois matrix given a linear combining rule (a_1*x_1+...+a_n*x_n=x_(n+1))
fr: Matrice de Galois étant donnée la règle de combinaison linéaire (a_1*x_+...+a_n*x_n=x_(n+1))

source: Use greedy algorithm to find c, for c . v = n. (v must be sorted)
fr: Utilise un algorithme glouton pour trouver c tel que c . v = n (v doit être trié).

source: Harmonic Number, the nth harmonic number of order r
fr: Nombre harmonique, le n-ième nombre harmonique d'ordre r

source: Hofstadter's function q(n) defined by q(1)=1, q(2)=1, q(n)=q(n-q(n-1))+q(n-q(n-2))
fr: Fonction de Hofstadter q(n) définie par q(1)=1, q(2)=1, q(n)=q(n-q(n-1))+q(n-q(n-2))

source: Compute linear recursive sequence using Galois stepping
fr: Calcule la relation de récurrence linéaire en utilisant l'algorithme de Galois

source: Calculate multinomial coefficients
fr: Calcule les coefficients multinomiaux

source: Get the Pascal's triangle as a matrix
fr: Renvoie le triangle de Pascal sous la forme d'une matrice

source: (Pochhammer) Rising factorial: (n)_k = n(n+1)...(n+(k-1))
fr: Factorielle croissante (Pochhammer) : (n)_k = n(n+1)...(n+(k-1))

source: Stirling number of the first kind
fr: Nombre de Stirling du premier type

source: Stirling number of the second kind
fr: Nombre de Stirling du second type

source: Subfactorial: n! times sum_{k=0}^n (-1)^k/k!
fr: Sous-factorielle : n! multiplié par sum_{k=0}^n (-1)^k/k!

source: Calculate the nth triangular number
fr: Calcule le n-ième nombre triangulaire

source: Calculate permutations
fr: Calcule les permutations
