Repository: GNOME/genius
Catalog: po/*.po
Languages: fr

source: Matrix index too large
fr: Indice de matrice trop grand

source: Matrix index less than 1
fr: Indice de matrice inférieur à 1

source: Matrix index out of range
fr: Indice de matrice hors intervalle

source: Trying to set a protected id '%s'
fr: Tentative de définir un identificateur protégé « %s »

source: Indexed Lvalue not user function
fr: La « Lvalue » indexée n'est pas une fonction utilisateur

source: Dereference of non-identifier!
fr: Déréférencement d'un non-identificateur.

source: Dereference of undefined variable!
fr: Déréférencement d'une variable non définie.

source: Dereference of non-reference!
fr: Déréférencement d'une non-référence.

source: Indexed Lvalue not an identifier or a dereference
fr: La Lvalue indexée n'est pas un identificateur ou un déréférencement

source: Matrix index not an integer or a vector
fr: L'indice de matrice n'est pas un entier ou un vecteur

source: Wrong matrix dimensions when setting
fr: Mauvaise taille de matrice lors de l'attribution

source: Lvalue not an identifier/dereference/matrix location!
fr: La Lvalue n'est pas un identificateur, un déréférencement ou un emplacement de matrice.

source: Referencing an undefined variable!
fr: Référencement d'une variable non définie.

source: Increment/Swapwith does not work on parameters (trying to increment '%s')
fr: « increment/swapwith » ne fonctionnent pas sur les paramètres (tentative d'incrémenter « %s »)

source: Increment not a value!
fr: L'incrément n'est pas une valeur.

source: Trying to increment non-value id '%s'
fr: Tentative d'incrémenter un identificateur sans valeur « %s »

source: Can only swap user variables
fr: On ne peut échanger que des variables utilisateur

source: Cannot swap matrix regions
fr: Impossible d'échanger les régions d'une matrice

source: Parameters can only be created in the global context
fr: Les paramètres ne peuvent être créés que dans le contexte global

source: Index works only on matrices
fr: L'indexation ne fonctionne que sur des matrices

source: Vector index not an integer or a vector
fr: L'indice du vecteur n'est pas un entier ou un vecteur

source: number
fr: nombre

source: matrix
fr: matrice

source: string
fr: chaîne de caractères

source: function
fr: fonction

source: identifier
fr: identificateur

source: polynomial
fr: polynôme

source: boolean
fr: booléen

source: Element by element addition
fr: Addition élément par élément

source: Subtraction
fr: Soustraction

source: Element by element subtraction
fr: Soustraction élément par élément

source: Element by element multiplication
fr: Multiplication élément par élément

source: Element by element division
fr: Division élément par élément

source: Back division
fr: Division arrière

source: Element by element back division
fr: Division arrière élément par élément

source: Element by element modulo
fr: Modulo élément par élément

source: Negation
fr: Négation

source: Power
fr: Puissance

source: Element by element power
fr: Puissance élément par élément

source: Factorial
fr: Factorielle

source: Double factorial
fr: Double factorielle

source: Transpose
fr: Transposée

source: ConjugateTranspose
fr: Transposée conjuguée

source: Comparison (<=>)
fr: Comparaison (<=>)

source: Bad types for '%s'
fr: Types non valides pour « %s »

source: %s not defined on <%s> and <%s>
fr: %s non défini sur <%s> et <%s>

source: Bad type for '%s'
fr: Type non valide pour « %s »

source: %s not defined on <%s>
fr: %s non défini sur <%s>

source: Vector building only works on numbers
fr: La construction de vecteur fonctionne uniquement avec des nombres

source: Impossible arguments to vector building operator
fr: Arguments incorrects pour l'opération de construction de vecteur

source: %s: argument too large
fr: %s : argument trop grand

source: Cannot parse version string: %s
fr: Impossible d'analyser la chaîne de version : %s

source: Genius %s %s This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program. If not, see <http://www.gnu.org/licenses/>.
fr: Genius %s %s Ce programme est un logiciel libre ; vous pouvez le diffuser et/ou le modifier suivant les termes de la Licence Publique Générale GNU telle que publiée par la Free Software Foundation ; soit la version 2 de cette licence, soit (à votre convenance) une version ultérieure. Ce programme est diffusé dans l'espoir qu'il sera utile, mais SANS AUCUNE GARANTIE ; sans même une garantie implicite de COMMERCIALISATION ou d'ADÉQUATION À UN USAGE PARTICULIER. Voyez la Licence Publique Générale GNU pour plus de détails. Vous devriez avoir reçu une copie de la Licence Publique Générale GNU avec ce programme sinon consultez <http://www.gnu.org/licenses/>.

source: %s: trying to undefine a protected id!
fr: %s : tentative d'élimination de la définition d'un identificateur protégé.

source: %s: trying to set a protected id!
fr: %s : tentative de définition d'un identificateur protégé.

source: %s: trying to set a parameter, use the equals sign
fr: %s : tentative de définir un paramètre, utilisez le signe égal

source: Global variables:
fr: Variables globales :

source: Function call stack:
fr: Pile d'appel de fonction :

source: (depth of context in parentheses)
fr: (profondeur du contexte entre parenthèses)

source: Local variables:
fr: Variables locales :

source: %s: Argument number %d not a string or identifier
fr: %s : l'argument numéro %d n'est pas une chaîne ou un identifiant

source: %s undefined
fr: %s non défini

source: %s: Too many arguments, should be at most %d
fr: %s : trop d'arguments, le maximum est %d

source: Cannot apply function to two differently sized matrices
fr: Impossible d'appliquer la fonction à deux matrices de tailles différentes

source: %s: Not implemented (yet) for complex values
fr: %s : non implémenté (pour l'instant) pour les valeurs complexes

source: %s: Bessel functions of second kind not defined for nonpositive real numbers
fr: %s : fonctions de Bessel de seconde expèce non définies pour les nombres rééls non positifs

source: %s: square root for composite moduli is not yet implemented
fr: %s : la racine carrée pour les modules composés n'est pas encore implémentée

source: %s: Cannot find square root function for prime moduli
fr: %s : impossible de trouver une fonction racine carrée pour les modules premiers

source: %s: matrix argument is not square
fr: %s : la matrice en argument n'est pas carrée

source: %s: matrix argument must be integer only
fr: %s : la matrice en argument doit être constituée d'entiers uniquement

source: %s: argument must be an integer
fr: %s : l'argument doit être un entier

source: Division by zero!
fr: Division par zéro.

source: %s: matrix argument must be value only
fr: %s : la matrice en argument doit uniquement être composée de valeurs

source: %s: Cannot compare complex numbers
fr: %s : Impossible de comparer des nombres complexes

source: %s: Input not a number or a matrix of numbers.
fr: %s : l'argument saisi n'est pas un nombre ou une matrice de nombres

source: %s: too many arguments
fr: %s : trop d'arguments

source: %s: vector argument not value only
fr: %s : le vecteur en argument doit uniquement être composé de valeurs

source: %s: argument can't be negative or 0
fr: %s : l'argument ne peut être négatif ou nul

source: %s: vector argument has too large entries
fr: %s : le vecteur en argument contient des entrées trop grandes

source: %s: arguments must be vectors of equal size
fr: %s : les arguments doivent être des vecteurs de même taille

source: %s: %s not a reference
fr: %s : %s n'est pas une référence

source: %s: matrices not of the same height
fr: %s : les matrices n'ont pas la même hauteur

source: third argument
fr: troisième argument

source: fourth argument
fr: quatrième argument

source: %s: argument must be greater than 2
fr: %s : l'argument doit être plus grand que 2

source: %s: arguments not horizontal vectors
fr: %s : les arguments ne sont pas des vecteurs horizontaux

source: %s: arguments not numeric only vectors
fr: %s : les arguments ne sont pas des nombres mais seulement des vecteurs

source: %s: argument 1 must be a quadratic polynomial
fr: %s : le premier argument doit être un polynôme quadratique

source: %s: value out of range
fr: %s : valeur hors limites

source: %s: undefined function
fr: %s : fonction non définie

source: %s: flags argument must be a string
fr: %s : le drapeau en argument doit être une chaîne

source: %s: argument not a function of one variable
fr: %s : l'argument n'est pas une fonction d'une variable

source: %s: argument should be between %d and %d
fr: %s : l'argument doit être compris entre %d et %d

source: OutputStyle must be one of normal, troff, latex or mathml
fr: OutputStyle doit être soit « normal », « troff », « latex » ou « mathml »

source: %s: argument should be larger or equal to 0
fr: %s : l'argument doit être supérieur ou égal à 0

source: Basic
fr: Bases

source: Parameters
fr: Paramètres

source: Constants
fr: Constantes

source: Numeric
fr: Numérique

source: Trigonometry
fr: Trigonométrie

source: Number Theory
fr: Théorie des nombres

source: Matrix Manipulation
fr: Manipulation des matrices

source: Linear Algebra
fr: Algèbre linéaire

source: Combinatorics
fr: Combinatoire

source: Calculus
fr: Calculs

source: Functions
fr: Fonctions

source: Equation Solving
fr: Résolution d'équations

source: Statistics
fr: Statistiques

source: Polynomials
fr: Polynômes

source: Set Theory
fr: Théorie des ensembles

source: Commutative Algebra
fr: Algèbre commutative

source: Miscellaneous
fr: Divers

source: Displays the user manual
fr: Affiche le manuel utilisateur

source: Gives the warranty information
fr: Renvoie des informations sur la licence

source: Return version as a 3-vector
fr: Renvoie la version comme un vecteur à 3 dimensions

source: Exits the program
fr: Quitte le programme

source: Prints a string to the error stream
fr: Affiche une chaîne dans le flux d'erreur

source: Waits a specified number of seconds
fr: Attends le nombre de secondes indiqué

source: The true boolean value
fr: La valeur booléenne vraie

source: The false boolean value
fr: La valeur booléenne fausse

source: Unix time in seconds as a floating point number
fr: Temps Unix exprimé en secondes en tant que nombre flottant

source: Make integer (0 or 1) from a boolean value
fr: Crée un entier (0 ou 1) à partir d'une valeur booléenne

source: Prints an expression
fr: Affiche une expression

source: Changes current directory
fr: Change le répertoire courant

source: Prints an expression without a trailing newline
fr: Affiche une expression sans retour à la ligne final

source: Display a string and an expression
fr: Affiche une chaîne et une expression

source: Set a global variable
fr: Définit une variable globale

source: Set an element in a global variable which is a matrix
fr: Définit un élément dans une variable globale qui est une matrice

source: Set an element in a global variable which is a vector
fr: Définit un élément dans une variable globale qui est un vecteur

source: Display values of variables, or all if called without arguments
fr: Affiche les valeurs des variables, ou tout si l'appel est lancé sans arguments

source: Set the category and help description line for a function
fr: Définit la catégorie et la ligne de description d'aide pour une fonction

source: Sets up a help alias
fr: Met en place un alias pour l'aide

source: Identity function, returns its argument
fr: Fonction identité, renvoie ses arguments

source: Generate random float between 0 and 1, or if size given generate vector or matrix of random floats
fr: Génère un nombre réel aléatoire compris entre 0 et 1 ou si la taille est fournie, génère un vecteur ou une matrice de nombres réels aléatoires

source: Generate random integer between 0 and max-1 inclusive, or if size given generate vector or matrix of random integers
fr: Génère un entier aléatoire compris entre 0 et max-1 inclus ou si la taille est fournie, génère un vecteur ou une matrice d'entiers aléatoires

source: Floating point precision
fr: Précision en virgule flottante

source: Display 0.0 when floating point number is less than 10^-x (0=never chop)
fr: Afficher 0.0 lorsqu'un nombre flottant est inférieur à 10^-x (0=jamais arrondir)

source: Only chop numbers when another number is greater than 10^-x
fr: Arrondir les nombres uniquement si un autre nombre est plus grand que 10^-x

source: Maximum digits to display
fr: Nombre maximum de chiffres à afficher

source: Maximum errors to display
fr: Nombre maximum d'erreurs à afficher

source: Output style: normal, latex, mathml or troff
fr: Style de sortie : « normal », « latex », « mathml » ou « troff »

source: Integer output base
fr: Base de sortie pour les entiers

source: If true, mixed fractions are printed
fr: Si vrai, les fractions mixtes sont affichées

source: Print full expressions, even if more than a line
fr: Affiche les expressions complètes, même celles de plus d'une ligne

source: Convert all results to floats before printing
fr: Convertit tous les résultats en nombres flottants avant de les afficher

source: Use scientific notation
fr: Utilise la notation scientifique

source: Number of extra Miller-Rabin tests to run on a number before declaring it a prime in IsPrime
fr: Nombre de tests supplémentaires de Miller-Rabin à lancer sur un nombre avant de le déclarer comme premier dans IsPrime

source: Expands a matrix just like we do on unquoted matrix input
fr: Développe une matrice de la même manière que pour les entrées de matrice non précédée d'une apostrophe

source: Gets the rows of a matrix as a vertical vector
fr: Extrait les lignes de matrice comme une vecteur vertical

source: Gets the columns of a matrix as a horizontal vector
fr: Extrait les colonnes de la matrice comme un vecteur horizontal

source: Gets the diagonal entries of a matrix as a column vector
fr: Extrait les données en diagonale de la matrice comme un vecteur colonne

source: Count the number of zero columns in a matrix
fr: Compte le nombre de colonnes de zéro dans une matrice

source: Removes any all-zero columns of M
fr: Supprime toutes les colonnes entièrement nulles de M

source: Return a vector with the indices of the nonzero columns in a matrix
fr: Renvoie un vecteur avec les indices des colonnes non nulles dans une matrice

source: Return a vector with the indices of the nonzero elements in a vector
fr: Renvoie un vecteur avec les indices des éléments non nuls dans un vecteur

source: Calculates the conjugate
fr: Calcule le complexe conjugué

source: Calculates the sine function
fr: Calcule la fonction sinus

source: Calculates the cosine function
fr: Calcule la fonction cosinus

source: Calculates the hyperbolic sine function
fr: Calcule la fonction sinus hyperbolique

source: Calculates the hyperbolic cosine function
fr: Calcule la fonction cosinus hyperbolique

source: Calculates the tan function
fr: Calcule la fonction tangente

source: Calculates the arctan function
fr: Calcule la fonction arctangente

source: Calculates the sinc function, that is sin(x)/x
fr: Calcule la fonction sinus cardinal, c'est-à-dire sin(x)/x

source: Calculates the arctan2 function (arctan(y/x) if x>0)
fr: Calcule la fonction arctan2 (arctan(y/x) si x>0)

source: The number pi
fr: Le nombre pi

source: The natural number e
fr: Le nombre naturel e

source: The Golden Ratio
fr: Le nombre d'or

source: Free fall acceleration
fr: Accélération de la chute libre

source: Euler's Constant gamma
fr: Constante gamma d'Euler

source: Catalan's Constant (0.915...)
fr: Constante de Catalan (0,915...)

source: The error function, 2/sqrt(pi) * int_0^x e^(-t^2) dt
fr: Fonction erreur : 2/sqrt(pi) * int_0^x e^(-t^2) dt

source: The Riemann zeta function (only real values implemented)
fr: Fonction zeta de Riemann (seules les valeurs réelles sont implémentées)

source: The Gamma function (only real values implemented)
fr: Fonction Gamma (seules les valeurs réelles sont implémentées)

source: The Bessel function of first kind of order 0
fr: La fonction de Bessel de première espèce d'ordre 0

source: The Bessel function of first kind of order 1
fr: La fonction de Bessel de première espèce d'ordre 1

source: The Bessel function of first kind of order n
fr: La fonction de Bessel de première espèce d'ordre n

source: The Bessel function of second kind of order 0
fr: La fonction de Bessel de seconde espèce d'ordre 0

source: The Bessel function of second kind of order 1
fr: La fonction de Bessel de seconde espèce d'ordre 1

source: The Bessel function of second kind of integer order n
fr: La fonction de Bessel de seconde espèce d'ordre n

source: The square root
fr: La racine carré

source: The exponential function
fr: La fonction exponentielle

source: The natural logarithm
fr: Le logarithme naturel

source: Logarithm of x base 2
fr: Le logarithme base 2 de x

source: Logarithm of x base 10
fr: Le logarithme base 10 de x

source: Round a number
fr: Arrondit un nombre

source: Get the highest integer less than or equal to n
fr: Renvoie le plus grand entier inférieur ou égale à n

source: Get the lowest integer more than or equal to n
fr: Renvoie le petit petit entier supérieur ou égal à n

source: Truncate number to an integer (return the integer part)
fr: Tronque le nombre à un entier (renvoie la partie entière)

source: Make number a float
fr: Transforme un nombre en nombre réel

source: Get the numerator of a rational number
fr: Renvoie le numérateur d'un nombre rationnel

source: Get the denominator of a rational number
fr: Renvoie le dénominateur d'un nombre rationnel

source: Greatest common divisor
fr: Plus grand commun diviseur (PGCD)

source: Least common multiplier
fr: Plus petit commun multiple (PPCM)

source: Check a number for being a perfect square
fr: Vérifie qu'un nombre est un carré parfait

source: Check a number for being any perfect power (a^b)
fr: Vérifie qu'un nombre est une puissance parfaite (a^b)

source: Return the nth prime (up to a limit)
fr: Renvoie le n-ième nombre premier (jusqu'à une limite)

source: Tests if an integer is even
fr: Teste si un entier est pair

source: Tests if an integer is odd
fr: Teste si un entier est impair

source: Returns the least prime greater than n (if n is positive)
fr: Renvoie le premier nombre premier supérieur à n (si n est positif)

source: Returns the nth Lucas number
fr: Renvoie le n-ième nombre de Lucas

source: Returns inverse of n mod m
fr: Renvoie l'inverse de n mod m

source: Checks divisibility (if m divides n)
fr: Vérifie la divisibilité (est-ce que m divise n)

source: Return n/d but only if d divides n else returns garbage (this is faster than writing n/d)
fr: Renvoie n/d mais seulement if d divise n sinon renvoie une valeur incorrecte (c'est plus rapide que d'écrire n/d)

source: Tests primality of integers, for numbers greater than 25*10^9 false positive is with low probability depending on IsPrimeMillerRabinReps
fr: Teste la primarité d'entiers, pour les nombres supérieur à 25*10^9, la probabilité d'une erreur de détermination dépend du paramètre IsPrimeMillerRabinReps

source: Run the strong pseudoprime test base b on n
fr: Lance le test de pseudo-primarité forte en base b sur n

source: Use the Miller-Rabin primality test on n, reps number of times. The probability of false positive is (1/4)^reps
fr: Utilise le test de primalité de Miller-Rabin sur n, en faisant « reps » essais. La probabilité d'une erreur de détermination est (1/4)^reps

source: Use the Miller-Rabin primality test on n with enough bases that assuming the Generalized Riemann Hypothesis the result is deterministic
fr: Utilise le test de primalité de Miller-Rabin sur n avec suffisamment d'essais pour qu'en supposant la véracité de l'hypothèse de Riemann généralisée, le résultat soit déterministe

source: Return factorization of a number as a matrix
fr: Renvoie la factorisation d'un nombre sous forme de matrice

source: Returns the maximum of arguments or matrix
fr: Renvoie le maximum des arguments ou de la matrice

source: Returns the minimum of arguments or matrix
fr: Renvoie le minimum des arguments ou de la matrice

source: Division w/o remainder, equivalent to floor(a/b)
fr: Division sans reste, équivalente à floor(a/b)

source: Calculate the Jacobi symbol (a/b) (b should be odd)
fr: Calcule le symbole de Jacobi (a/b) (b doit être impair)

source: Calculate the Jacobi symbol (a/b) with the Kronecker extension (a/2)=(2/a) when a odd, or (a/2)=0 when a even
fr: Calcule le symbole de Jacobi (a/b) avec l'extension de Kronecker (a/2)=(2/a) si impair, ou (a/2)=0 si pair

source: Calculate the Legendre symbol (a/p)
fr: Calcule le symbole de Legendre (a/p)

source: Get the real part of a complex number
fr: Renvoie la partie réelle d'un nombre complexe

source: Get the imaginary part of a complex number
fr: Renvoie la partie imaginaire d'un nombre complexe

source: Make an identity matrix of a given size
fr: Construit une matrice identité de la taille donnée

source: Make an matrix of all zeros (or a row vector)
fr: Construit une matrice de zéros (ou un vecteur ligne)

source: Make an matrix of all ones (or a row vector)
fr: Construit une matrice de uns (ou un vecteur ligne)

source: Get the number of rows of a matrix
fr: Renvoie le nombre de lignes d'une matrice

source: Get the number of columns of a matrix
fr: Renvoie le nombre de colonnes d'une matrice

source: Is a matrix square
fr: Vérifie que la matrice est carrée

source: Is argument a horizontal or a vertical vector
fr: Vérifie que l'argument est un vecteur ligne ou colonne

source: Is a matrix upper triangular
fr: Vérifie que la matrice est triangulaire supérieure

source: Is a matrix lower triangular
fr: Vérifie que la matrice triangulaire inférieure

source: Is a matrix diagonal
fr: Vérifie que la matrice est diagonale

source: Get the number of elements of a matrix
fr: Renvoie le nombre d'éléments d'une matrice

source: Get the row echelon form of a matrix
fr: Renvoie la forme échelonnée en lignes d'une matrice

source: Get the reduced row echelon form of a matrix
fr: Renvoie la forme échelonnée réduite en lignes d'une matrice

source: Solve linear system Mx=V, return solution V if there is a unique solution, null otherwise. Extra two reference parameters can optionally be used to get the reduced M and V.
fr: Résout le système linéaire Mx=V, renvoie V s'il y a une solution unique ou « null » sinon. Deux références de paramètres supplémentaires peuvent être utilisés pour recevoir les réductions de M et V.

source: Get the determinant of a matrix
fr: Renvoie le déterminant d'une matrice

source: Return pivot columns of a matrix, that is columns which have a leading 1 in rref form, also returns the row where they occur
fr: Renvoie les colonnes-pivot d'une matrice, c'est-à-dire quelles sont les colonnes d'une matrice réduite suivant l'algorithme rref (diagonalisation) qui contiennent 1 en première position, et renvoie également dans quelles lignes se trouvent ces derniers

source: Get the nullspace of a matrix
fr: Renvoie le noyau d'une matrice

source: Make new matrix of given size from old one
fr: Construit une nouvelle matrice, de la taille donnée, à partir de l'ancienne

source: Return the index complement of a vector of indexes
fr: Renvoie le complémentaire d'un vecteur d'indices.

source: Get the Hermitian product of two vectors
fr: Renvoie le produit hermitien de deux vecteurs
