Repository: GNOME/genius
Catalog: po/*.po
Languages: fr

source: Raise the plot window, and create the window if necessary
fr: Remonte la fenêtre de tracé, et crée la fenêtre si nécessaire

source: Wait for a click on the line plot window, return the location.
fr: Attend un clic sur la fenêtre de tracé de ligne, renvoie l'emplacement.

source: Return current mouse location on the line plot window.
fr: Renvoie l"emplacement actuel de la souris sur la fenêtre de tracé de ligne.

source: Export the current contents of the plot canvas to a file. The file type is given by the string type, which can be "png", "eps", or "ps".
fr: Exporte le contenu actuel du canevas de tracé dans un fichier. Le type de fichier est donné par le type de chaîne, qui peut être « png », « eps » ou « ps ».

source: Number of slopefield ticks as a vector [vertical,horizontal].
fr: Nombre de traits du champ de directions sous la forme d'un vecteur [vertical,horizontal].

source: Number of vectorfield ticks as a vector [vertical,horizontal].
fr: Nombre de traits de champ de vecteurs sous la forme d'un vecteur [vertical,horizontal].

source: Default names used by all 2D plot functions. Should be a 4 vector of strings or identifiers [x,y,z,t].
fr: Noms par défaut utilisés par toutes les fonctions de tracé 2D. Doit être un vecteur à 4 composantes de chaînes de caractères ou d'identifiants [x,y,z,t].

source: Default names used by surface plot functions. Should be a 3 vector of strings or identifiers [x,y,z] (where z=x+iy and not the dependent axis).
fr: Noms par défaut utilisés par toutes les fonctions de tracé de surface. Doit être un vecteur à 3 composantes de chaînes de caractères ou d'identifiants [x,y,z] (où z est z=x+iy et non pas l'axe dépendant).

source: Normalize vectorfields if true. That is, only show direction and not magnitude.
fr: Normalise les longueurs de flèches du tracé de champ de vecteurs si true (vrai), c'est-à-dire n'affiche que la direction et pas l'amplitude.

source: If to draw legends or not on line plots.
fr: Indique s'il faut dessiner la légende ou pas sur les tracés de lignes.

source: If to draw axis labels on line plots.
fr: Indique s'il faut dessiner les étiquettes d'axe ou pas sur les tracés de lignes.

source: If to draw legends or not on surface plots.
fr: Indique s'il faut dessiner la légende ou pas sur les tracés de surface.

source: Line plotting window (limits) as a 4-vector of the form [x1,x2,y1,y2]
fr: Fenêtre de tracé de droite (limites) définie comme un vecteur à 4 composantes sous la forme [x1,x2,y1,y2]

source: Surface plotting window (limits) as a 6-vector of the form [x1,x2,y1,y2,z1,z2]
fr: Fenêtre de tracé de surface (limites) définie comme un vecteur à 6 composantes sous la forme [x1,x2,y1,y2,z1,z2]

source: Determinant of a non-square matrix is undefined
fr: Le déterminant d'une matrice non carrée n'est pas défini

source: Trying to increment a nonvalue
fr: Tentative d'incrémenter quelque chose sans valeur

source: Integer exponent too large to compute
fr: Exposant entier trop grand pour cette opération

source: Can't do modulo of floats or rationals!
fr: Impossible de calculer le modulo de nombres flottants ou rationnels.

source: Can't do GCD of floats or rationals!
fr: Impossible de calculer le PGCD de nombres flottants ou rationnels.

source: Can't modulo invert non integers!
fr: Impossible de calculer l'inverse modulo n pour les nombres non entiers.

source: Can't get Jacobi symbols of floats or rationals!
fr: Impossible d'obtenir les symboles de Jacobi pour les flottants ou les rationnels.

source: Can't get Legendre symbols of floats or rationals!
fr: Impossible d'obtenir le symbole de Legendre pour les flottants ou les rationnels.

source: Can't get Jacobi symbol with Kronecker extension of floats or rationals!
fr: Impossible d'obtenir le symbole de Jacobi avec l'extension de Kronecker pour les flottants ou les rationnels.

source: Lucas must get an integer argument!
fr: Lucas doit recevoir un argument entier.

source: Number too large to compute Lucas number!
fr: Nombre trop grand pour en calculer le nombre de Lucas.

source: No such thing as negative Lucas numbers!
fr: Il n'existe pas de nombre de Lucas négatifs.

source: Cannot get next prime after non-integer!
fr: Impossible d'obtenir le prochain nombre premier suivant un non entier.

source: %s: can't work on non-integers!
fr: %s : ne fonctionne pas sur des non entiers.

source: Can't do factorials of rationals or floats!
fr: Impossible de calculer la factorielle de rationnels ou de flottants.

source: Number too large to compute factorial!
fr: Nombre trop grand pour en calculer la factorielle.

source: Can't do factorials of negative numbers!
fr: Impossible de calculer la factorielle de nombres négatifs.

source: Can't do binomials of rationals or floats!
fr: Impossible de calculer le coefficient binomial de rationnels ou de flottants.

source: %s: Bad types for mod power
fr: %s : mauvais type pour une puissance modulo

source: Can't invert %s modulo %s in %s
fr: Impossible d'inverser %s modulo %s dans %s

source: Can't make random integer from a non-integer
fr: Impossible de calculer un nombre aléatoire à partir d'un non entier

source: Range for random integer must be positive
fr: La plage pour les entiers aléatoires doit être positive

source: Can't get numerator of floating types
fr: Impossible d'obtenir le numérateur des types flottants

source: Can't compare complex numbers
fr: Impossible de comparer des nombres complexes

source: Can't modulo complex numbers
fr: Impossible de calculer le modulo de nombres complexes

source: Inverse of %s modulo %s not found!
fr: Inverse de %s modulo %s non trouvé.

source: Can't do modulo invert on complex numbers
fr: Impossible de calculer le modulo inverse de nombres complexes

source: Can't GCD complex numbers
fr: Impossible de calculer le PGCD de nombres complexes

source: Can't LCM complex numbers
fr: Impossible de calculer le PPCM de nombres complexes

source: Can't get Jacobi symbols of complex numbers
fr: Impossible de calculer le symbole de Jacobi de nombres complexes

source: Can't get Legendre symbols of complex numbers
fr: Impossible de calculer les symboles de Legendre de nombres complexes

source: Can't get Jacobi symbol with Kronecker extension for complex numbers
fr: Impossible d'obtenir le symbole de Jacobi avec les extensions de Kronecker pour les nombres complexes

source: Can't get Lucas number for complex numbers
fr: Impossible de calculer le nombre de Lucas pour les nombres complexes

source: Can't get next prime for complex numbers
fr: Impossible d'obtenir le nombre premier suivant pour des nombres complexes

source: %s: can't work on complex numbers
fr: %s : ne s'utilise pas sur les nombres complexes

source: %s: can't take logarithm of 0
fr: %s : impossible de calculer le logarithme de 0

source: arctan2 not defined for complex numbers
fr: La fonction arctan2 n'est pas définie pour les nombres complexes

source: Can't make random integer out of a complex number
fr: Impossible de créer un entier aléatoire à partir d'un nombre complexe

source: Can't make factorials of complex numbers
fr: Impossible de calculer la factorielle d'un nombre complexe

source: Can't make binomials of complex numbers
fr: Impossible de calculer le coefficient binomial d'un nombre complexe

source: Can't determine type of a complex number
fr: Impossible de déterminer le type d'un nombre complexe

source: Can't convert complex number into integer
fr: Impossible de convertir un nombre complexe en entier

source: Can't convert real number to integer
fr: Impossible de convertir un nombre réel en entier

source: Integer too large for this operation
fr: Entier trop grand pour cette opération

source: Can't convert complex number into a double
fr: Impossible de convertir un nombre complexe en double

source: Can't convert real number to double
fr: Impossible de convertir un nombre réel en double

source: Number too large for this operation
fr: Nombre trop grand pour cette opération

source: ERROR: local statement not the first statement in function definition
fr: ERREUR : l'instruction « local » n'est pas la première instruction dans la définition de la fonction

source: Can't open plugin!
fr: Impossible d'ouvrir le greffon.

source: Can't initialize plugin!
fr: Impossible d'initialiser le greffon.

source: %s: '%s' not a function of one variable
fr: %s : « %s » n'est pas une fonction à une variable

source: %s: Cannot differentiate the '%s' function
fr: %s : la fonction « %s » ne peut pas être dérivée

source: Symbolic Operations
fr: Opérations symboliques

source: Attempt to symbolically differentiate the function f, where f is a function of one variable.
fr: Essaie de dériver de manière symbolique la fonction f, où f est une fonction à une variable.

source: Attempt to symbolically differentiate the function f, where f is a function of one variable, returns null if unsuccessful but is silent.
fr: Essaie de dériver de manière symbolique la fonction f, où f est une fonction à une variable, renvoie « null » si cela ne marche pas mais reste silencieuse.

source: This is the test-plugin function
fr: Ceci est la fonction test-plugin

source: You have opened test plugin! Will evaluate 2+2 as a demonstration 2+2 =
fr: Vous avez ouvert le greffon de test ! Il va évaluer 2+2 comme démonstration 2+2 =

source: For my next trick I will add a function named TestPluginFunction
fr: Pour mon prochain tour, je vais ajouter une fonction nommée TestPluginFunction

source: That's it, isn't this fun
fr: Voilà, n'est-ce pas amusant ?

source: Stack underflow!
fr: Dépassement de capacité négatif de pile.
