Repository: GNOME/genius
Catalog: po/*.po
Languages: fr

source: Check if a matrix is a matrix of numbers
fr: Vérifie qu'une matrice est constituée de nombres

source: Check if a matrix is an integer (non-complex) matrix
fr: Vérifie qu'une matrice est constituée de nombres entiers (non complexes)

source: Check if a matrix is a rational (non-complex) matrix
fr: Vérifie qu'une matrice est constituée de nombres rationnels (non complexes)

source: Check if a matrix is a real (non-complex) matrix
fr: Vérifier qu'une matrice est constituée de nombres réels (non complexes)

source: Check if a matrix is positive, that is if each element is positive
fr: Vérifie qu'une matrice est positive, c'est-à-dire que chaque élément est positif

source: Check if a matrix is nonnegative, that is if each element is nonnegative
fr: Vérifie qu'une matrice est non négative, c'est-à-dire que chaque élément est non négatif

source: Check if a number or a matrix is all zeros
fr: Vérifie qu'un nombre ou une matrice est entièrement constitué de zéros

source: Check if a number or a matrix is 1 or identity respectively
fr: Vérifie qu'un nombre ou une matrice est 1 ou l'identité respectivement

source: Returns true if the element x is in the set X (where X is a vector pretending to be a set)
fr: Renvoie true (vrai) si l'élément x fait partie de l'ensemble X (où X est un vecteur supposé être un ensemble)

source: Returns true if X is a subset of Y
fr: Renvoie true (vrai) si X est un sous-ensemble de Y

source: Returns a set theoretic difference X-Y (X and Y are vectors pretending to be sets)
fr: Renvoie la différence X-Y selon la théorie des ensembles (X et Y sont des vecteurs supposés être des ensembles)

source: Returns a set theoretic intersection of X and Y (X and Y are vectors pretending to be sets)
fr: Renvoie l'intersection, selon la théorie des ensembles, de X et Y (X et Y sont des vecteurs supposés être des ensembles)

source: Check if argument is a null
fr: Vérifie que l'argument est « null »

source: Check if argument is a number
fr: Vérifie que l'argument est un nombre

source: Check if argument is a boolean (and not a number)
fr: Vérifie que l'argument est un booléen (et pas un nombre)

source: Check if argument is a text string
fr: Vérifie que l'argument est une chaîne de caractères

source: Check if argument is a matrix
fr: Vérifie que l'argument est une matrice

source: Check if argument is a function
fr: Vérifie que l'argument est une fonction

source: Check if argument is a function or an identifier
fr: Vérifie que l'argument est une fonction ou un identificateur

source: Check if argument is a function reference
fr: Vérifie que l'argument est une référence à une fonction

source: Check if argument is a complex (non-real) number
fr: Vérifie que l'argument est un nombre complexe (non réel)

source: Check if argument is a real number
fr: Vérifie que l'argument est une nombre réel

source: Check if argument is an integer (non-complex)
fr: Vérifie que l'argument est un entier (non complexe)

source: Check if argument is a positive real integer
fr: Vérifie que l'argument est un entier réel positif

source: Check if argument is a non-negative real integer
fr: Vérifie que l'argument est un entier réel non négatif

source: Check if argument is a possibly complex integer
fr: Vérifie que l'argument peut être un entier complexe

source: Check if argument is a rational number (non-complex)
fr: Vérifie que l'argument est un nombre rationnel (non complexe)

source: Check if argument is a possibly complex rational number
fr: Vérifie que l'argument peut être un nombre complexe rationnel

source: Check if argument is a floating point number (non-complex)
fr: Vérifie que l'argument est un nombre flottant (non complexe)

source: Add two polynomials (vectors)
fr: Ajoute deux polynômes (vecteurs)

source: Subtract two polynomials (as vectors)
fr: Soustrait deux polynômes (comme vecteurs)

source: Multiply two polynomials (as vectors)
fr: Multiplie deux polynômes (comme vecteurs)

source: Divide polynomial p by q, return the remainder in r
fr: Divise les polynômes p par q et renvoie le reste r

source: Take polynomial (as vector) derivative
fr: Prend la dérivée du polynôme (comme vecteur)

source: Take second polynomial (as vector) derivative
fr: Prend la dérivée seconde du polynôme (comme vecteur)

source: Trim zeros from a polynomial (as vector)
fr: Retire les zéros d'un polynôme (défini comme vecteur)

source: Check if a vector is usable as a polynomial
fr: Vérifie qu'un vecteur est utilisable en tant que polynôme

source: Make string out of a polynomial (as vector)
fr: Fabrique une chaîne à partir d'un polynôme (comme vecteur)

source: Make function out of a polynomial (as vector)
fr: Fabrique une fonction à partir d'un polynôme (comme vecteur)

source: Find roots of a quadratic polynomial (given as vector of coefficients)
fr: Cherche les racines d'un polynôme du second degré (donné par un vecteur de coefficients)

source: Get all combinations of k numbers from 1 to n as a vector of vectors
fr: Renvoie toutes les combinaisons de k nombres de 1 à n comme un vecteur de vecteurs

source: Get combination that would come after v in call to combinations, first combination should be [1:k].
fr: Calcule la combinaison qui apparaîtrait après v dans un appel à la fonction combinations, la première combinaison devrait être [1:k].

source: Get all permutations of k numbers from 1 to n as a vector of vectors
fr: Renvoie toutes les permutations de k nombres de 1 à n comme un vecteur de vecteurs

source: Calculate combinations (binomial coefficient)
fr: Calcule le nombre de combinaisons (coefficient binomial)

source: Convert a string to a vector of ASCII values
fr: Convertit une chaîne en vecteur de valeurs ASCII

source: Convert a vector of ASCII values to a string
fr: Convertit un vecteur de valeurs ASCII en chaîne

source: Convert a string to a vector of 0-based alphabet values (positions in the alphabet string), -1's for unknown letters
fr: Convertit une chaîne en un vecteur de valeurs commençant à 0 (positions dans la chaîne alphabétique), -1 pour chaque lettre non trouvée

source: Convert a vector of 0-based alphabet values (positions in the alphabet string) to a string
fr: Convertit un vecteur de valeurs commençant à 0 (positions dans la chaîne alphabétique) en chaîne

source: Protect a variable from being modified. It will be treated as a system defined variable from now on. Protected parameters can still be modified.
fr: Protège une variable de toute modification. Elle est maintenant traitée comme une variable définie par le système. Les paramètres protégés peuvent encore être modifiés.

source: Unprotect a variable from being modified. It will be treated as a user defined variable from now on.
fr: Annule la protection d'une variable contre toute modification. Elle est maintenant traitée comme une variable définie par l'utilisateur.

source: Set flags for a function, currently "PropagateMod" and "NoModuloArguments"
fr: Positionne les drapeaux pour une fonction, actuellement « PropagateMod » et « NoModuloArguments »

source: Get current modulo from the context outside the function
fr: Obtient le modulo actuel à partir du contexte extérieur à la fonction.

source: Check if a variable or function is defined
fr: Vérifie si une variable ou une fonction est définie

source: Undefine a variable (including all locals and globals of the same name)
fr: Annule la définition d'une variable (y compris toutes les variables locales et globales de même nom)

source: Undefine all unprotected (user defined) global variables and parameters. Does not reset or change protected (system) parameters.
fr: Annule la définition de tous les paramètres et variables globales (définis par l'utilisateur) non protégés. Ne remet pas à zéro ou ne modifie pas les paramètres (système) protégés.

source: Mark all currently defined variables as protected. They will be treated as system defined variables from now on.
fr: Marque toutes les variables actuellement définies comme protégées. Elles sont maintenant traitées comme des variables définies par le système.

source: Return a vector of all global unprotected (user defined) variable names.
fr: Renvoie un vecteur contenant tous les noms des variables globales (définies par l'utilisateur) non protégées.

source: Parse a string (but do not execute)
fr: Analyse (mais n'évalue pas) une chaîne de caractères

source: Parse and evaluate a string
fr: Analyse et évalue une chaîne de caractères

source: Ask a question and return a string. Optionally pass in a default.
fr: Pose une question et renvoie une chaîne de caractères. Il est possible de transmettre une valeur par défaut.

source: Ask a question and present a list of buttons. Returns the 1-based index of the button pressed (or null on failure).
fr: Pose une question et présente une liste de boutons. Renvoie l'indice en base 1 du bouton enfoncé (ou « null » en cas d'échec).

source: Integration of f by Composite Simpson's Rule on the interval [a,b] with n subintervals with error of max(f'''')*h^4*(b-a)/180, note that n should be even
fr: Intégration de f par la méthode de Simpson composée sur l'intervalle [a,b] avec n sous-intervalles avec une erreur de l'ordre max(f'''')*h^4*(b-a)/180, notez que n doit être pair

source: %s: argument number %d not an integer
fr: %s : l'argument numéro %d n'est pas un entier

source: %s: argument number %d not an integer or a matrix
fr: %s : l'argument numéro %d n'est pas un entier ou une matrice

source: %s: argument number %d not a number or a matrix
fr: %s : l'argument numéro %d n'est pas un nombre ou une matrice

source: %s: argument number %d not a nonnegative integer
fr: %s : l'argument numéro %d n'est pas un entier non négatif

source: %s: argument number %d not a nonnegative number
fr: %s : l'argument numéro %d n'est pas un nombre non négatif

source: %s: argument number %d not a positive integer
fr: %s : l'argument numéro %d n'est pas un entier positif

source: %s: argument number %d not a number
fr: %s : l'argument numéro %d n'est pas un entier

source: %s: argument number %d not a boolean
fr: %s : l'argument numéro %d n'est pas un booléen

source: %s: argument number %d not a real number
fr: %s : l'argument numéro %d n'est pas un nombre réel

source: %s: argument number %d not a matrix
fr: %s : l'argument numéro %d n'est pas une matrice

source: %s: argument number %d not a square matrix
fr: %s : l'argument numéro %d n'est pas une matrice carrée

source: %s: argument number %d not a matrix or null node
fr: %s : l'argument numéro %d n'est pas une matrice ou un nœud « null »

source: %s: argument number %d not a value only matrix
fr: %s : l'argument numéro %d n'est pas une matrice qui contient seulement des valeurs

source: %s: argument number %d not a value only vector
fr: %s : l'argument numéro %d n'est pas un vecteur qui contient seulement des valeurs

source: %s: argument number %d not a string
fr: %s : l'argument numéro %d n'est pas une chaîne de caractères

source: %s: argument number %d not a function or identifier
fr: %s : l'argument numéro %d n'est pas une fonction ou un identifiant

source: line %d: %s
fr: ligne %d : %s

source: Too many errors! (%d followed)
fr: Trop d'erreurs (%d autorisées).

source: Cannot locate the manual
fr: Impossible de trouver le manuel

source: Suggested: %s
fr: Suggestion : %s

source: Out of range!
fr: Hors limites

source: %s should be between %d and %d, using %d
fr: %s doit être compris entre %d et %d, en utilisant %d

source: %s should be greater then or equal to %d, using %d
fr: %s doit être supérieur ou égal à %d, en utilisant %d

source: Genius %s usage: genius [options] [files] --help Print this help --version Print version number --precision=num Floating point precision [128] --maxdigits=num Maximum digits to display (0=no limit) [0] --[no]floatresult All results as floats [OFF] --[no]scinot Results in scientific notation [OFF] --[no]fullexp Always print full expressions [OFF] --maxerrors=num Maximum errors to display (0=no limit) [5] --[no]mixed Print fractions in mixed format --intoutbase=num Base to use to print out integers [10] --chop=num Chop small numbers less than 10^-num [20] --chopwhen=num But only when other numbers 10^-num or more [5] --[no]readline Use readline if it is available [ON] --[no]compile Compile everything and dump it to stdout [OFF] --[no]gettext Dump help/error strings in fake .c file to stdout (for use with gettext) [OFF] --[no]quiet Be quiet during non-interactive mode, (always on when compiling) [OFF] --exec=expr Execute an expression
fr: Utilisation de Genius %s : genius [options] [fichiers] --help Affiche cette aide --version Affiche le numéro de version --precision=num Précision en virgule flottante [128] --maxdigits=num Nombre maximun de chiffres à afficher (0=pas de limite) [0] --[no]floatresult Tous les résultats sont flottants [OFF] --[no]scinot Résultats en notation scientifique [OFF] --[no]fullexp Toujours afficher les expressions complètes [OFF] --maxerrors=num Maximum d'erreurs à afficher (0=pas de limite) [5] --[no]mixed Affiche les fractions en format mixte --intoutbase=num Base à utiliser pour afficher les entiers [10] --chop=num Arrondit les petits nombres plus petit que 10^-num [20] --chopwhen=num Mais seulement si d'autres nombres sont 10^-num ou plus [5] --[no]readline Utilise readline si disponible [ON] --[no]compile Compile tout et l'affiche sur stdout [OFF] --[no]gettext Enregistre les messages d'aide/erreur du fichier postiche .c vers stdout (pour utiliser avec gettext) [OFF] --[no]quiet Est silencieux en mode non-interactif, (toujours activé lors d'une compilation) [OFF] --exec=expr Exécute une expression

source: Can't specify both an expression and files to execute on the command line
fr: Impossible de spécifier en même temps une expression et des fichiers à exécuter en ligne de commande

source: Genius %s %s This is free software with ABSOLUTELY NO WARRANTY. For license details type `warranty'. For help type `manual' or `help'.%s
fr: Genius %s %s Ceci est un logiciel libre sans AUCUNE GARANTIE. Pour des détails sur la licence, saisissez « warranty ». Pour obtenir de l'aide, saisissez « manual » ou « help ».%s

source: The only thing that interferes with my learning is my education. -- Albert Einstein
fr: La seule chose qui interfère avec mon apprentissage est mon éducation. -- Albert Einstein

source: Can't open file
fr: Impossible d'ouvrir le fichier

source: String
fr: Chaîne de caractères

source: Line Comment
fr: Ligne de commentaire

source: Base-N Integers
fr: Entiers en base-N

source: Decimal Integers
fr: Entiers décimaux

source: Floats
fr: Flottants

source: Commands
fr: Commandes

source: Keywords
fr: Mots clés

source: _File
fr: _Fichier

source: _Edit
fr: É_dition

source: _Calculator
fr: _Calculateur

source: P_lugins
fr: _Greffons

source: E_xamples
fr: E_xemples

source: _Programs
fr: Progra_mmes

source: _Settings
fr: _Paramètres

source: _Help
fr: Aid_e

source: _New Program
fr: _Nouveau programme

source: Create new program tab
fr: Crée un nouvel onglet de programme

source: New
fr: Nouveau

source: _Open...
fr: _Ouvrir...

source: Open a file
fr: Ouvre un fichier

source: Open
fr: Ouvrir

source: Open R_ecent
fr: Ouvrir un document _récent

source: _Save
fr: _Enregistrer

source: Save current file
fr: Enregistre le fichier actuel

source: Save All _Unsaved
fr: Enregistrer _tout

source: Save all unsaved programs
fr: Enregistre tous les programmes non sauvegardés

source: Save _As...
fr: Enregistrer _sous...

source: Save to a file
fr: Enregistre dans un fichier

source: _Reload from Disk
fr: Recharger à partir du _disque

source: Reload the selected program from disk
fr: Recharge le programme sélectionné à partir du disque

source: _Close
fr: _Fermer

source: Close the current file
fr: Ferme le fichier actuel

source: _Load and Run...
fr: Charger et e_xécuter...

source: Load and execute a file in genius
fr: Charge et exécute un fichier dans genius

source: Save Console Ou_tput...
fr: Enregistrer la sortie _console...

source: Save what is visible on the console (including scrollback) to a text file
fr: Enregistre dans un fichier texte tout ce qui est visible à la console (archives incluses)

source: _Quit
fr: _Quitter

source: Quit
fr: Quitte

source: _Undo
fr: Ann_uler

source: Undo the last action
fr: Annule la dernière action

source: _Redo
fr: _Rétablir

source: Redo the undone action
fr: Rétablit une action annulée

source: Cu_t
fr: _Couper

source: Cut the selection
fr: Coupe la sélection

source: _Copy
fr: Co_pier

source: Copy the selection
fr: Copie la sélection

source: _Paste
fr: C_oller

source: Paste the clipboard
fr: Colle le contenu du presse-papiers

source: Copy Answer As Plain Te_xt
fr: Copier la réponse au format te_xte brut

source: Copy last answer into the clipboard in plain text
fr: Copie la dernière réponse dans le presse-papiers au format texte brut

source: Copy Answer As _LaTeX
fr: Copier la réponse au format _LaTeX

source: Copy last answer into the clipboard as LaTeX
fr: Copie la dernière réponse dans le presse-papiers au format LaTeX

source: Copy Answer As _MathML
fr: Copier la réponse au format _MathML

source: Copy last answer into the clipboard as MathML
fr: Copie la dernière réponse dans le presse-papiers au format MathML

source: Copy Answer As T_roff
fr: Copier la réponse au format T_roff

source: Copy last answer into the clipboard as Troff eqn
fr: Copie la dernière réponse dans le presse-papiers comme une équation Troff

source: _Run
fr: _Exécuter

source: Run current program
fr: Lance le programme actuel

source: _Interrupt
fr: _Interrompre

source: Interrupt current calculation
fr: Interrompt le calcul actuel

source: Show _Full Answer
fr: Afficher la réponse _complète

source: Show the full text of last answer
fr: Affiche le texte complet de la dernière réponse

source: Show User _Variables
fr: Afficher les _variables utilisateur

source: Show the current value of all user variables
fr: Affiche la valeur actuelle de toutes les variables utilisateur

source: _Monitor a Variable
fr: _Surveiller une variable

source: Monitor a variable continuously
fr: Surveille une variable en continu

source: _Plot...
fr: _Tracer...

source: Plot functions, vector fields, surfaces, etc...
fr: Trace des fonctions, lignes de champ, surface, etc.

source: _Plot
fr: _Tracer

source: _Next Tab
fr: Onglet _suivant

source: Go to next tab
fr: Se déplace au prochain onglet

source: _Previous Tab
fr: Onglet _précédent

source: Go to previous tab
fr: Se déplace à l'onglet précédent

source: Go to the console tab
fr: Se déplace à l'onglet console

source: _Preferences
fr: _Préférences

source: _Contents
fr: _Sommaire

source: View the Genius manual
fr: Affiche le manuel utilisateur

source: _Help on Function
fr: _Aide sur les fonctions

source: Help on a function or a command
fr: Affiche l'aide d'une fonction ou d'une commande

source: _Warranty
fr: _Licence

source: Display warranty information
fr: Affiche les informations sur la licence

source: _About
fr: À _propos

source: About Genius
fr: À propos de Genius

source: Help on Function
fr: Aide sur les fonctions

source: Function or command name:
fr: Nom de la fonction ou de la commande :

source: <b>Help on %s not found</b>
fr: <b>L'aide sur %s n'a pas été trouvée</b>

source: <b>Help on %s not found</b> Perhaps you meant %s.
fr: <b>L'aide sur %s n'a pas été trouvée</b> Peut-être vouliez-vous dire %s.

source: Error
fr: Erreur

source: Information
fr: Informations

source: User Variable Listing
fr: Liste des variables utilisateur

source: %s undefined
fr: %s non défini

source: (context %d)
fr: (contexte %d)

source: %s not a user variable
fr: %s n'est pas une variable utilisateur

source: Monitoring: %s
fr: Surveillance : %s

source: Update continuously
fr: Mise à jour en continu

source: Monitor a Variable
fr: Surveillance d'une variable

source: Variable name:
fr: Nom de la variable :

source: Full Answer
fr: Réponse complète

source: Too many errors! (%d followed)
fr: Trop d'erreurs (%d successives)

source: e[01;31mToo many errors! (%d followed)e[0m
fr: e[01;31mTrop d'erreurs ! (%d successives)e[0m

source: <b>Cannot display help</b> %s
fr: <b>Impossible d'afficher l'aide</b> %s

source: Nils Barth (initial implementation of parts of the GEL library)
fr: Nils Barth (implémentation initiale d'une partie de la bibliothèque GEL)

source: translator-credits
fr: Vincent Renardias <vincent@ldsol.com> Sébastien Bacher <seb128@debian.org> Bruno Brouard <annoa.b@gmail.com> Stéphane Raimbault <stephane.raimbault@gmail.com>

source: Genius Mathematical Tool
fr: Outil de maths Genius

source: The GNOME calculator style edition of the Genius Mathematical Tool.
fr: La version GNOME façon calculatrice de l'outil de maths Genius.

source: Genius is executing something, and furthermore there are unsaved programs. Are you sure you wish to quit?
fr: Un programme est en cours d'exécution par Genius et de plus certains programmes ne sont pas enregistrés. Êtes-vous sûr de vouloir quitter ?

source: There are unsaved programs, are you sure you wish to quit?
fr: Il y a des programmes non enregistrés, êtes-vous sûr de vouloir quitter ?

source: Genius is executing something, are you sure you wish to quit?
fr: Un programme est en cours d'exécution par Genius. Êtes-vous sûr de vouloir quitter ?

source: Are you sure you wish to quit?
fr: Êtes-vous sûr de vouloir quitter ?

source: Genius Setup
fr: Configuration de Genius

source: Output
fr: Sortie

source: Number/Expression output options
fr: Options pour la sortie des nombres/expressions

source: Maximum digits to output (0=unlimited)
fr: Nombre maximum de chiffres à afficher (0=non limité)

source: Results as floats
fr: Résultats en nombres flottants

source: Floats in scientific notation
fr: Nombres flottants en notation scientifique

source: Always print full expressions
fr: Toujours afficher les expressions complètes

source: Use mixed fractions
fr: Utiliser les fractions mixtes

source: Remember output settings across sessions
fr: Se souvenir des paramètres de sortie d'une session à l'autre

source: Should the output settings in the "Number/Expression output options" frame be remembered for next session. Does not apply to the "Error/Info output options" frame.
fr: Indique si les paramètres de sortie dans la catégorie « Options pour la sortie des nombres/expressions » doivent être conservés pour la session suivante. Ne s'applique pas à la catégorie « Options pour la sortie erreurs/information ».

source: Error/Info output options
fr: Options pour la sortie erreurs/information

source: Display errors in a dialog
fr: Afficher les erreurs dans une boîte de dialogue

source: Display information messages in a dialog
fr: Afficher les messages d'information dans une boîte de dialogue

source: Maximum errors to display (0=unlimited)
fr: Nombre maximum d'erreurs à afficher (0=non limité)

source: Precision
fr: Précision

source: NOTE: The floating point precision might not take effect for all numbers immediately, only new numbers calculated and new variables will be affected.
fr: Note : la précision en virgule flottante peut ne pas prendre effet immédiatement pour tous les nombres, seuls les nouveaux nombres calculés et les nouvelles variables seront affectées.

source: Floating point precision (bits)
fr: Précision en virgule flottante (bits)

source: Remember precision setting across sessions
fr: Se souvenir de la précision choisie d'une session à l'autre

source: Should the precision setting be remembered for next session.
fr: Indique si la précision choisie doit être enregistrée pour la prochaine session.

source: Terminal options
fr: Options du terminal

source: Scrollback lines
fr: Lignes d'historique

source: Font:
fr: Police :

source: Black on white
fr: Noir sur blanc

source: Blinking cursor
fr: Curseur clignotant

source: Memory
fr: Mémoire
